{
  "title": "Westminster Confession of Faith - PCA",
  "about": "This version of the WCF was adopted by the Presbyterian Church in America.",
  "chapters": [
    {
      "chapter": "Chapter 1: Of the Holy Scripture",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Although the light of nature, and the works of creation and providence do so far manifest the goodness, wisdom, and power of God, as to leave men unexcusable; yet are they not sufficient to give that knowledge of God, and of His will, which is necessary unto salvation. Therefore it pleased the Lord, at sundry times, and in divers manners, to reveal Himself, and to declare that His will unto His Church; and afterwards for the better preserving and propagating of the truth, and for the more sure establishment and comfort of the Church against the corruption of the flesh, and the malice of Satan and of the world, to commit the same wholly unto writing; which makes the Holy Scripture to be most necessary; those former ways of God's revealing His will unto His people being now ceased.</p>",
          "footnotes": "<b><sup>a</sup></b> Psa 19:1-3; Rom 1:19-20; 1:32 with Rom. 2:1; 2:14-15.<br><b><sup>b</sup></b> 1 Cor 1:21; 2:13-14.<br><b><sup>c</sup></b> Heb 1:1.<br><b><sup>d</sup></b> Prov 22:19-21; Isa 8:19-20; Mat 4:4, 7, 10; Luke 1:3-4; Rom 15:4.<br><b><sup>e</sup></b> 2 Tim 3:15; 2 Pet 1:19.<br><b><sup>f</sup></b> Heb 1:1-2."
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. Under the name of holy Scripture, or the Word of God written, are now contained all the books of the Old and New Testaments, which are these:</p><div><table id=\"table4\"><tbody><tr><td colspan=\"3\"><strong>Of the Old Testament</strong></td></tr><tr valign=\"top\"><td>Genesis. Exodus. Leviticus. Numbers. Deuteronomy. Joshua. Judges. Ruth. I Samuel. II Samuel. I Kings. II Kings. I Chronicles.</td><td>II Chronicles. Ezra. Nehemiah. Esther. Job. Psalms. Proverbs. Ecclesiastes. The Song of Songs. Isaiah. Jeremiah. Lamentations. Ezekiel.</td><td>Daniel. Hosea. Joel. Amos. Obadiah. Jonah. Micah. Nahum. Habakkuk. Zephaniah. Haggai. Zechariah. Malachi.</td></tr><tr><td colspan=\"3\"><strong>Of the New Testament</strong></td></tr><tr valign=\"top\"><td>The Gospels according to Matthew, Mark, Luke, John. The Acts of the Apostles. Paul’s Epistles to the Romans. Corinthians I.</td><td>Corinthians II. Galatians. Ephesians. Philippians. Colossians. Thessalonians I. Thessalonians II. To Timothy I. To Timothy II. To Titus. To Philemon.</td><td>The Epistle to the Hebrews. The Epistle of James. The First and Second Epistles of Peter. The First, Second, and Third Epistles of John. The Epistle of Jude. The Revelation.</td></tr></tbody></table></div><p>All which are given by inspiration of God, to be the rule of faith and life.<b><sup>a</sup></b>",
          "footnotes": "<b><sup>a</sup></b> Luke 16:29, 31; Eph 2:20; 2 Tim 3:16; Rev 22:18-19."
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. The books commonly called Apocrypha, not being of divine inspiration, are no part of the Canon of the Scripture; and therefore are of no authority in the Church of God, nor to be any otherwise approved, or made use of, than other human writings.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Luke 24:27, 44; Rom 3:2; 2 Pet 1:21."
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. The authority of the holy Scripture, for which it ought to be believed and obeyed, dependeth not upon the testimony of any man or church, but wholly upon God (who is truth itself), the Author thereof; and therefore it is to be received, because it is the Word of God.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Thes 2:13; 2 Tim 3:16; 2 Pet 1:19, 21; 1 John 5:9."
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. We may be moved and induced by the testimony of the Church to an high and reverent esteem of the holy Scripture;<b><sup>a</sup></b>and the heavenliness of the matter, the efficacy of the doctrine, the majesty of the style, the consent of all the parts, the scope of the whole (which is to give all glory to God), the full discovery it makes of the only way of man’s salvation, the many other incomparable excellencies, and the entire perfection thereof, are arguments whereby it doth abundantly evidence itself to be the Word of God; yet, notwithstanding, our full persuasion and assurance of the infallible truth, and divine authority thereof, is from the inward work of the Holy Spirit, bearing witness by and with the Word in our hearts.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Tim 3:15.<br><b><sup>b</sup></b> Isa 59:21; John 16:13-14; 1 Cor 2:10-12; 1 John 2:20, 27."
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. The whole counsel of God, concerning all things necessary for his own glory, man’s salvation, faith, and life, is either expressly set down in Scripture, or by good and necessary consequence may be deduced from Scripture: unto which nothing at any time is to be added, whether by new revelations of the Spirit, or traditions of men.<b><sup>a</sup></b> Nevertheless we acknowledge the inward illumination of the Spirit of God to be necessary for the saving understanding of such things as are revealed in the Word;<b><sup>b</sup></b> and that there are some circumstances concerning the worship of God, and government of the Church, common to human actions and societies, which are to be ordered by the light of nature and Christian prudence, according to the general rules of the Word, which are always to be observed.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gal 1:8-9; 2 Thes 2:2; 2 Tim 3:15-17.<br><b><sup>b</sup></b> John 6:45; 1 Cor 2:9-12.<br><b><sup>c</sup></b> 1 Cor 11:13-14; 14:26, 40."
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. All things in Scripture are not alike plain in themselves, nor alike clear unto all;<b><sup>a</sup></b> yet those things which are necessary to be known, believed, and observed, for salvation, are so clearly propounded and opened in some place of Scripture or other, that not only the learned, but the unlearned, in a due use of the ordinary means, may attain unto a sufficient understanding of them.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 2 Pet 3:16.<b><sup>b</sup></b> Psa 119:105, 130."
        },
        {
          "paragraphNumber": 8,
          "text": "<p>VIII. The Old Testament in Hebrew (which was the native language of the people of God of old), and the New Testament in Greek (which at the time of the writing of it was most generally known to the nations), being immediately inspired by God, and by his singular care and providence kept pure in all ages, are therefore authentical;<b><sup>a</sup></b> so as in all controversies of religion the Church is finally to appeal unto them.<b><sup>b</sup></b> But because these original tongues are not known to all the people of God who have right unto, and interest in the Scriptures, and are commanded, in the fear of God, to read and search them,<b><sup>c</sup></b>therefore they are to be translated into the vulgar language of every nation unto which they come,<b><sup>d</sup></b> that the Word of God dwelling plentifully in all, they may worship him in an acceptable manner,<b><sup>e</sup></b> and, through patience and comfort of the Scriptures, may have hope.<b><sup>f</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 5:18.<br><b><sup>b</sup></b> Isa 8:20; John 5:39, 46; Acts 15:15.<br><b><sup>c</sup></b> John 5:39.<br><b><sup>d</sup></b> 1 Cor 14:6, 9, 11-12, 24, 27-28.<br><b><sup>e</sup></b> Col 3:16.<br><b><sup>f</sup></b> Rom 15:4."
        },
        {
          "paragraphNumber": 9,
          "text": "<p>IX. The infallible rule of interpretation of Scripture is the Scripture itself; and therefore, when there is a question about the true and full sense of any scripture (which is not manifold, but one), it must be searched and known by other places that speak more clearly.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Acts 15:15; 2 Pet 1:20-21."
        },
        {
          "paragraphNumber": 10,
          "text": "<p>X. The Supreme Judge, by which all controversies of religion are to be determined, and all decrees of councils, opinions of ancient writers, doctrines of men, and private spirits, are to be examined, and in whose sentence we are to rest, can be no other but the Holy Spirit speaking in the Scripture.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 22:29, 31; Eph 2:20 with Acts 28:25."
        }
      ]
    },
    {
      "chapter": "Chapter 2: Of God, and the Holy Trinity",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. There is but one only<b><sup>a</sup></b> living and true God,<b><sup>b</sup></b> who is infinite in being and perfection,<b><sup>c</sup></b> a most pure spirit,<b><sup>d</sup></b> invisible,<b><sup>e</sup></b> without body, parts,<b><sup>f</sup></b> or passions,<b><sup>g</sup></b> immutable,<b><sup>h</sup></b> immense,<b><sup>i</sup></b> eternal,<b><sup>j</sup></b> incomprehensible,<b><sup>k</sup></b> almighty,<b><sup>l</sup></b> most wise,<b><sup>m</sup></b> most holy,<b><sup>n</sup></b> most free,<b><sup>o</sup></b> most absolute,<b><sup>p</sup></b> working all things according to the counsel of his own immutable and most righteous will,<b><sup>q</sup></b> for his own glory;<b><sup>r</sup></b> most loving,<b><sup>s</sup></b> gracious, merciful, long-suffering, abundant in goodness and truth, forgiving iniquity, transgression, and sin;<b><sup>t</sup></b> the rewarder of them that diligently seek him;<b><sup>u</sup></b> and withal most just and terrible in his judgments;<b><sup>v</sup></b> hating all sin,<b><sup>w</sup></b> and who will by no means clear the guilty.<b><sup>x</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Deut 6:4; 1 Cor 8:4, 6.<br><b><sup>b</sup></b> Jer 10:10; 1 Thes 1:9.<br><b><sup>c</sup></b> Job 11:7-9; 26:14.<br><b><sup>d</sup></b> John 4:24. <b><sup>e</sup></b> 1 Tim 1:17.<br><b><sup>f</sup></b> Deut 4:15-16; John 4:24 with Luke 24:39.<br><b><sup>g</sup></b> Acts 14:11, 15.<br><b><sup>h</sup></b> Mal 3:6; James 1:17.<br><b><sup>i</sup></b> 1 Kings 8:27; Jer 23:23-24.<br><b><sup>j</sup></b> Psa 90:2; 1 Tim 1:17.<br><b><sup>k</sup></b> Psa 145:3. <b><sup>l</sup></b> Gen 17:1; Rev 4:8.<br><b><sup>m</sup></b> Rom 16:27. <b><sup>n</sup></b> Isa 6:3; Rev 4:8.<br><b><sup>o</sup></b> Psa 115:3. <b><sup>p</sup></b> Exod 3:14.<br><b><sup>q</sup></b> Eph 1:11.<br><b><sup>r</sup></b> Prov 16:4; Rom 11:36.<br><b><sup>s</sup></b> 1 John 4:8, 16.<br><b><sup>t</sup></b> Exod 34:6-7. <b><sup>u</sup></b> Heb 11:6.<br><b><sup>v</sup></b> Neh 9:32-33. <b><sup>w</sup></b> Psa 5:5-6.<br><b><sup>x</sup></b> Exod 34:7; Nahum 1:2-3."
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. God hath all life,<b><sup>a</sup></b> glory,<b><sup>b</sup></b> goodness,<b><sup>c</sup></b> blessedness,<b><sup>d</sup></b> in and of himself; and is alone in and unto himself all-sufficient, not standing in need of any creatures which he hath made,<b><sup>e</sup></b> nor deriving any glory from them,<b><sup>f</sup></b> but only manifesting his own glory in, by, unto, and upon them: he is the alone fountain of all being, of whom, through whom, and to whom are all things;<b><sup>g</sup></b> and hath most sovereign dominion over them, to do by them, for them, or upon them whatsoever himself pleaseth.<b><sup>h</sup></b> In his sight all things are open and manifest;<b><sup>i</sup></b> his knowledge is infinite, infallible, and independent upon the creature;<b><sup>j</sup></b> so as nothing is to him contingent or uncertain.<b><sup>k</sup></b> He is most holy in all his counsels, in all his works, and in all his commands.<b><sup>l</sup></b> To him is due from angels and men, and every other creature, whatsoever worship, service, or obedience, he is pleased to require of them.<b><sup>m</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 5:26. <b><sup>b</sup></b> Acts 7:2.<br><b><sup>c</sup></b> Psa 119:68. <b><sup>d</sup></b> Rom 9:5; 1 Tim 6:15.<br><b><sup>e</sup></b> Acts 17:24-25. <b><sup>f</sup></b> Job 22:2-3.<br><b><sup>g</sup></b> Rom 11:36. <b><sup>h</sup></b> Dan 4:25, 35; 1 Tim 6:15; Rev 4:11.<br><b><sup>i</sup></b> Heb 4:13. <b><sup>j</sup></b> Psa 147:5; Rom 11:33-34.<br><b><sup>k</sup></b> Ezek 11:5; Acts 15:18. <b><sup>l</sup></b> Psa 145:17; Rom 7:12.<br><b><sup>m</sup></b> Rev 5:12-14."
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. In the unity of the Godhead there be three persons, of one substance, power, and eternity: God the Father, God the Son, and God the Holy Ghost.<b><sup>a</sup></b> The Father is of none, neither begotten nor proceeding; the Son is eternally begotten of the Father;<b><sup>b</sup></b> the Holy Ghost eternally proceeding from the Father and the Son.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 3:16-17; 28:19; 2 Cor 13:14; 1 John 5:7.<br><b><sup>b</sup></b> John 1:14, 18.<br><b><sup>c</sup></b> John 15:26; Gal 4:6."
        }
      ]
    },
    {
      "chapter": "Chapter 3: Of God’s Eternal Decree",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. God from all eternity did, by the most wise and holy counsel of his own will, freely and unchangeably ordain whatsoever comes to pass;<b><sup>a</sup></b> yet so as thereby neither is God the author of sin,<b><sup>b</sup></b> nor is violence offered to the will of the creatures, nor is the liberty or contingency of second causes taken away, but rather established.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 9:15, 18; 11:33; Eph 1:11; Heb 6:17.<br><b><sup>b</sup></b> James 1:13, 17; 1 John 1:5.<br><b><sup>c</sup></b> Prov 16:33; Mat 17:12; John 19:11; Acts 2:23; 4:27-28."
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. Although God knows whatsoever may or can come to pass upon all supposed conditions,<b><sup>a </sup></b>yet hath he not decreed anything because he foresaw it as future, or as that which would come to pass upon such conditions.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Sam 23:11-12; Mat 11:21, 23; Acts 15:18.<br><b><sup>b</sup></b> Rom 9:11, 13, 16, 18."
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. By the decree of God, for the manifestation of his glory, some men and angels<b><sup>a</sup></b> are predestinated unto everlasting life, and others fore-ordained to everlasting death.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 25:41; 1 Tim 5:21.<br><b><sup>b</sup></b> Prov 16:4; Rom 9:22-23; Eph 1:5-6."
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. These angels and men, thus predestinated and fore-ordained, are particularly and unchangeably designed; and their number is so certain and definite that it can not be either increased or diminished.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 13:18; 2 Tim 2:19."
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. Those of mankind that are predestinated unto life, God, before the foundation of the world was laid, according to his eternal and immutable purpose, and the secret counsel and good pleasure of his will, hath chosen in Christ, unto everlasting glory,<b><sup>a</sup></b> out of his mere free grace and love, without any foresight of faith or good works, or perseverance in either of them, or any other thing in the creature, as conditions, or causes moving him thereunto;<b><sup>b</sup></b> and all to the praise of his glorious grace.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 8:30; Eph 1:4, 9, 11; 1 Thes 5:9; 2 Tim 1:9.<br><b><sup>b</sup></b> Rom 9:11, 13, 16; Eph 1:4, 9.<br><b><sup>c</sup></b> Eph 1:6, 12."
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. As God hath appointed the elect unto glory, so hath he, by the eternal and most free purpose of his will, fore-ordained all the means thereunto.<b><sup>a</sup></b> Wherefore they who are elected, being fallen in Adam, are redeemed by Christ,<b><sup>b</sup></b> are effectually called unto faith in Christ by his Spirit working in due season; are justified, adopted, sanctified,<b><sup>c</sup></b> and kept by his power through faith unto salvation.<b><sup>d</sup></b> Neither are any other redeemed by Christ, effectually called, justified, adopted, sanctified, and saved, but the elect only.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Eph 1:4-5; Eph 2:10; 2 Thes 2:13; 1 Pet 1:2.<br><b><sup>b</sup></b> 1 Thes 5:9-10; Titus 2:14.<br><b><sup>c</sup></b> Rom 8:30; Eph 1:5; 2 Thes 2:13.<br><b><sup>d</sup></b> 1 Pet 1:5.<br><b><sup>e</sup></b> John 6:64-65; 8:47; 10:26; 17:9; Rom 8:28-39; 1 John 2:19."
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. The rest of mankind God was pleased, according to the unsearchable counsel of his own will, whereby he extendeth or withholdeth mercy as he pleaseth, for the glory of his sovereign power over his creatures, to pass by, and to ordain them to dishonor and wrath for their sin, to the praise of his glorious justice.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 11:25-26; Rom 9:17-18, 21-22; 2 Tim 2:19-20; 1 Pet 2:8; Jude 1:4."
        },
        {
          "paragraphNumber": 8,
          "text": "<p>VIII. The doctrine of this high mystery of predestination is to be handled with special prudence and care,<b><sup>a</sup></b> that men attending the will of God revealed in his Word, and yielding obedience thereunto, may, from the certainty of their effectual vocation, be assured of their eternal election.<b><sup>b</sup></b> So shall this doctrine afford matter of praise, reverence, and admiration of God;<b><sup>c </sup></b>and of humility, diligence, and abundant consolation to all that sincerely obey the gospel.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Deut 29:29; Rom 9:20.<br> <b><sup>b</sup></b> 2 Pet 1:10.<br> <b><sup>c</sup></b> Rom 11:33; Eph 1:6.<br> <b><sup>d</sup></b> Luke 10:20; Rom 8:33; 11:5-6, 20; 2 Pet 1:10."
        }
      ]
    },
    {
      "chapter": "Chapter 4: Of Creation",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "I. It pleased God the Father, Son, and Holy Ghost,<b><sup>a</sup></b> for the manifestation of the glory of his eternal power, wisdom, and goodness,<b><sup>b</sup></b> in the beginning, to create or make of nothing the world, and all things therein, whether visible or invisible, in the space of six days, and all very good.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 1:2; Job 26:13; 33:4; John 1:2-3; Heb 1:2.<br> <b><sup>b</sup></b> Psa 33:5-6; 104:24; Jer 10:12; Rom 1:20.<br> <b><sup>c</sup></b> Gen 1 throughout; Acts 17:24; Col 1:16; Heb 11:3."
        },
        {
          "paragraphNumber": 2,
          "text": "II. After God had made all other creatures, he created man, male and female,<b><sup>a</sup></b> with reasonable and immortal souls,<b><sup>b</sup></b>endued with knowledge, righteousness, and true holiness, after his own image,<b><sup>c</sup></b> having the law of God written in their hearts,<b><sup>d</sup></b> and power to fulfil it;<b><sup>e</sup></b> and yet under a possibility of transgressing, being left to the liberty of their own will, which was subject unto change.<b><sup>f</sup></b> Beside this law written in their hearts, they received a command not to eat of the tree of the knowledge of good and evil;<b><sup>g</sup></b> which while they kept they were happy in their communion with God, and had dominion over the creatures.<b><sup>h</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 1:27.<br> <b><sup>b</sup></b> Gen 2:7 with Ecc 12:7 and Mat 10:28 and Luke 23:43.<br> <b><sup>c</sup></b> Gen 1:26; Eph 4:24; Col 3:10.<br> <b><sup>d</sup></b> Rom 2:14-15.<br> <b><sup>e</sup></b> Ecc 7:29.<br> <b><sup>f</sup></b> Gen 3:6; Ecc 7:29.<br> <b><sup>g</sup></b> Gen 2:17; 3:8-11, 23.<br> <b><sup>h</sup></b> Gen 1:26, 28."
        }
      ]
    },
    {
      "chapter": "Chapter 5: Of Providence",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. God, the great Creator of all things, doth uphold,<b><sup>a</sup></b> direct, dispose, and govern all creatures, actions, and things,<b><sup>b</sup></b> from the greatest even to the least,<b><sup>c</sup></b> by his most wise and holy providence,<b><sup>d</sup></b> according to his infallible fore-knowledgee and the free and immutable counsel of his own will,<b><sup>f</sup></b> to the praise of the glory of his wisdom, power, justice, goodness, and mercy.<b><sup>g</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Heb 1:3.<br> <b><sup>b</sup></b> Psa 135:6; Dan 4:34-35; Acts 17:25-26, 28; Job 38-41 throughout.<br> <b><sup>c</sup></b> Mat 10:29-31.<br> <b><sup>d</sup></b> Psa 104:24; 145:17; Prov 15:3.<br> <b><sup>e</sup></b> Psa 94:8-11; Acts 15:18.<br> <b><sup>f</sup></b> Psa 33:10-11; Eph 1:11.<br> <b><sup>g</sup></b> Gen 45:7; Psa 145:7; Isa 63:14; Rom 9:17; Eph 3:10."
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. Although in relation to the foreknowledge and decree of God, the first cause, all things come to pass immutably and infallibly,<b><sup>a</sup></b> yet by the same providence he ordereth them to fall out, according to the nature of second causes, either necessarily, freely, or contingently.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Acts 2:23.<br><b><sup>b</sup></b> Gen 8:22; Exod 21:13 with Deut 19:5; 1 Kings 22:28, 34; Isa 10:6-7; Jer 31:35."
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. God, in his ordinary providence, maketh use of means,<b><sup>a</sup></b> yet is free to work without,<b><sup>b</sup></b>above,<b><sup>c</sup></b> and against them,<b><sup>d</sup></b> at his pleasure.</p>",
          "footnotes": "<b><sup>a</sup></b> Isa 55:10-11; Hosea 2:21-22; Acts 27:31, 44.<br/>\n<b><sup>b</sup></b> Job 34:10; Hosea 1:7; Mat 4:4.<br/>\n<b><sup>c</sup></b> Rom 4:19-21.<br/>\n<b><sup>d</sup></b> 2 Kings 6:6; Dan 3:27.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. The almighty power, unsearchable wisdom, and infinite goodness of God so far manifest themselves in his providence that it extendeth itself even to the first fall, and all other sins of angels and men,<b><sup>a</sup></b> and that not by a bare permission,<b><sup>b</sup></b> but such as hath joined with it a most wise and powerful bounding,<b><sup>c</sup></b> and otherwise ordering and governing of them, in a manifold dispensation, to his own holy ends;<b><sup>d</sup></b> yet so as the sinfulness thereof proceedeth only from the creature, and not from God; who, being most holy and righteous, neither is nor can be the author or approver of sin.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 2 Sam 16:10; 24:1 with 1 Chr 21:1; 1 Kings 22:22-23; 1 Chr 10:4, 13-14; Acts 2:23; 4:27-28; Rom 11:32-34.<br/>\n<b><sup>b</sup></b> Acts 14:16.<br/>\n<b><sup>c</sup></b> 2 Kings 19:28; Psa 76:10.<br/>\n<b><sup>d</sup></b> Gen 50:20; Isa 10:6-7, 12.<br/>\n<b><sup>e</sup></b> Psa 50:21; James 1:13-14, 17; 1 John 2:16.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. The most wise, righteous, and gracious God doth oftentimes leave for a season his own children to manifold temptations and the corruption of their own hearts, to chastise them for their former sins, or to discover unto them the hidden strength of corruption and deceitfulness of their hearts, that they be humbled;<b><sup>a</sup></b> and to raise them to a more close and constant dependence for their support unto himself, and to make them more watchful against all future occasions of sin, and for sundry other just and holy ends.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 2 Sam 24:1; 2 Chr 32:25-26, 31.<br/>\n<b><sup>b</sup></b> Psa 73 throughout; Psa 77:1-10, 12; Mark 14:66-72 with John 21:15-17; 2 Cor 12:7-9.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. As for those wicked and ungodly men whom God, as a righteous judge, for former sins, doth blind and harden,<b><sup>a</sup></b> from them he not only withholdeth his grace, whereby they might have been enlightened in their understandings and wrought upon in their hearts,<b><sup>b</sup></b> but sometimes also withdraweth the gifts which they had,<b><sup>c</sup></b> and exposeth them to such objects as their corruption makes occasion of sin;<b><sup>d</sup></b> and withal, gives them over to their own lusts, the temptations of the world, and the power of Satan;<b><sup>e</sup></b> whereby it comes to pass that they harden themselves, even under those means which God useth for the softening of others.<b><sup>f</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 1:24, 26, 28; 11:7-8.<br/>\n<b><sup>b</sup></b> Deut 29:4.<br/>\n<b><sup>c</sup></b> Mat 13:12; 25:29.<br/>\n<b><sup>d</sup></b> Deut 2:30; 2 Kings 8:12-13.<br/>\n<b><sup>e</sup></b> Psa 81:11-12; 2 Thes 2:10-12.<br/>\n<b><sup>f</sup></b> Exod 7:3 with Exod 8:15; 8:32; Isa 6:9-10 with Acts 28:26-27; Isa 8:14; 2 Cor 2:15-16; 1 Pet 2:7-8.</div>"
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. As the providence of God doth, in general, reach to all creatures, so, after a most special manner, it taketh care of his Church, and disposeth all things to the good thereof.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Isa 43:3-5, 14; Amos 9:8-9; Rom 8:28; 1 Tim 4:10.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 6: Of the Fall of Man, of Sin, and of the Punishment Thereof",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Our first parents, being seduced by the subtlety and temptation of Satan, sinned in eating the forbidden fruit.<b><sup>a</sup></b> This their sin God was pleased, according to his wise and holy counsel, to permit, having purposed to order it to his own glory.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gn 3.13, 2 Cor 11.3, Gn 3.1-14.<br/>\n<b><sup>b</sup></b> Rom 11.32, 5.19-21.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. By this sin they fell from their original righteousness and communion with God,<b><sup>a</sup></b> and so became dead in sin,<b><sup>b</sup></b> and wholly defiled in all the faculties and parts of soul and body.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 3:6-8; Ecc 7:29; Rom 3:23.<br/>\n<b><sup>b</sup></b> Gen 2:17; Eph 2:1.<br/>\n<b><sup>c</sup></b> Gen 6:5; Jer 17:9; Rom 3:10-19; Titus 1:15.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. They being the root of all mankind, the guilt of this sin was imputed,<b><sup>a</sup></b> and the same death in sin and corrupted nature conveyed to all their posterity descending from them by ordinary generation.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 1:27-28 and Gen 2:16-17 and Acts 17:26 with Rom 5:12, 15-19 and 1 Cor 15:21-22; 1Cor 15:45, 49.<br/>\n<b><sup>b</sup></b> Gen 5:3; Job 14:4; 15:14; Psa 51:5.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. From this original corruption, whereby we are utterly indisposed, disabled, and made opposite to all good,<b><sup>a</sup></b> and wholly inclined to all evil,<b><sup>b</sup></b> do proceed all actual transgressions.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 5:6; 7:18; 8:7; Col 1:21.<br/>\n<b><sup>b</sup></b> Gen 6:5; 8:21; Rom 3:10-12.<br/>\n<b><sup>c</sup></b> Mat 15:19; Eph 2:2-3; James 1:14-15.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. This corruption of nature, during this life, doth remain in those that are regenerated;<b><sup>a</sup></b> and although it be through Christ pardoned and mortified, yet both itself and all the motions thereof are truly and properly sin.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Prov 20:9; Ecc 7:20; Rom 7:14, 17-18, 23; James 3:2; 1 John 1:8, 10.<br/>\n<b><sup>b</sup></b> Rom 7:5, 7-8, 25; Gal 5:17.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. Every sin, both original and actual, being a transgression of the righteous law of God, and contrary thereunto,<b><sup>a</sup></b> doth, in its own nature, bring guilt upon the sinner,<b><sup>b</sup></b> whereby he is bound over to the wrath of Godc and curse of the law,<b><sup>d</sup></b> and so made subject to death,<b><sup>e</sup></b> with all miseries spiritual,<b><sup>f</sup></b> temporal,<b><sup>g</sup></b> and eternal.<b><sup>h</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 3:4.<br/>\n<b><sup>b</sup></b> Rom 2:15; 3:9, 19.<br/>\n<b><sup>c</sup></b> Eph 2:3.<br/>\n<b><sup>d</sup></b> Gal 3:10.<br/>\n<b><sup>e</sup></b> Rom 6:23.<br/>\n<b><sup>f</sup></b> Eph 4:18.<br/>\n<b><sup>g</sup></b> Lam 3:39; Rom 8:20.<br/>\n<b><sup>h</sup></b> Mat 25:41; 2 Thes 1:9.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 7: Of God’s Covenant with Man",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. The distance between God and the creature is so great that although reasonable creatures do owe obedience unto him as their Creator, yet they could never have any fruition of him as their blessedness and reward but by some voluntary condescension on God's part, which he hath been pleased to express by way of covenant.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 3:4.<br/>\n<b><sup>b</sup></b> Rom 2:15; 3:9, 19.<br/>\n<b><sup>c</sup></b> Eph 2:3.<br/>\n<b><sup>d</sup></b> Gal 3:10.<br/>\n<b><sup>e</sup></b> Rom 6:23.<br/>\n<b><sup>f</sup></b> Eph 4:18.<br/>\n<b><sup>g</sup></b> Lam 3:39; Rom 8:20.<br/>\n<b><sup>h</sup></b> Mat 25:41; 2 Thes 1:9.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. The first covenant made with man was a covenant of works,<b><sup>a</sup></b> wherein life was promised to Adam, and in him to his posterity,<b><sup>b</sup></b> upon condition of perfect and personal obedience.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Sam 2:25; Job 9:32-33; 22:2-3; 35:7-8; Psa 100:2-3; 113:5-6; Isa 40:13-17; Luke 17:10; Acts 17:24-25.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Man by his fall having made himself incapable of life by that covenant, the Lord was pleased to make a second,<b><sup>a</sup></b> commonly called the covenant of grace: wherein he freely offered unto sinners life and salvation by Jesus Christ, requiring of them faith in him that they may be saved,<b><sup>b</sup></b> and promising to give unto all those that are ordained unto life his Holy Spirit, to make them willing and able to believe.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gal 3:12.<br/>\n<b><sup>b</sup></b> Rom 5:12-20; 10:5.<br/>\n<b><sup>c</sup></b> Gen 2:17; Gal 3:10.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. This covenant of grace is frequently set forth in the Scripture by the name of a testament, in reference to the death of Jesus Christ the testator, and to the everlasting inheritance, with all things belonging to it, therein bequeathed.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Luke 22:20; 1 Cor 11:25; Heb 7:22; 9:15-17.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. This covenant was differently administered in the time of the law and in the time of the gospel:<b><sup>a</sup></b> under the law it was administered by promises, prophecies, sacrifices, circumcision, the paschal lamb, and other types and ordinances delivered to the people of the Jews, all fore-signifying Christ to come,<b><sup>b</sup></b> which were for that time sufficient and efficacious, through the operation of the Spirit, to instruct and build up the elect in faith in the promised Messiah,<b><sup>c</sup></b> by whom they had full remission of sins and eternal salvation; and is called the Old Testament.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 2 Cor 3:6-9.<br/>\n<b><sup>b</sup></b> Rom 4:11; Col 2:11-12; 1 Cor 5:7; Hebrews 8-10 throughout.<br/>\n<b><sup>c</sup></b> John 8:56; 1 Cor 10:1-4; Heb 11:13.<br/>\n<b><sup>d</sup></b> Gal 3:7-9, 14.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. Under the gospel, when Christ the substance<b><sup>a</sup></b> was exhibited, the ordinances in which this covenant is dispensed are the preaching of the Word and the administration of the sacraments of Baptism and the Lord's Supper;<b><sup>b</sup></b> which, though fewer in number, and administered with more simplicity and less outward glory, yet in them it is held forth in more fulness, evidence, and spiritual efficacy,<b><sup>c</sup></b> to all nations, both Jews and Gentiles;<b><sup>d</sup></b> and is called the New Testament.<b><sup>e</sup></b> There are not, therefore, two covenants of grace differing in substance, but one and the same under various dispensations.<b><sup>f</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Col 2:17.<br/>\n<b><sup>b</sup></b> Mat 28:19-20; 1 Cor 11:23-25.<br/>\n<b><sup>c</sup></b> Jer 31:33-34; Heb 12:22-28.<br/>\n<b><sup>d</sup></b> Mat 28:19; Eph 2:15-19.<br/>\n<b><sup>e</sup></b> Luke 22:20.<br/>\n<b><sup>f</sup></b> Psa 32:1 with Rom 4:3; Acts 15:11; Rom 3:21-23, 30; 4:6, 16-17, 23-24; Gal 3:14, 16; Heb 13:8.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 8: Of Christ the Mediator",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. It pleased God, in his eternal purpose, to choose and ordain the Lord Jesus, his only-begotten Son, to be the Mediator between God and man,<b><sup>a</sup></b> the Prophet,<b><sup>b</sup></b> Priest,<b><sup>c</sup></b> and King;<b><sup>d</sup></b>the Head and Saviour of his Church,<b><sup>e</sup></b> the Heir of all things,<b><sup>f</sup></b> and Judge of the world;<b><sup>g</sup></b> unto whom he did, from all eternity, give a people to be his seed,<b><sup>h</sup></b> and to be by him in time redeemed, called, justified, sanctified, and glorified.<b><sup>i</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Isa 42:1; John 3:16; 2 Tim 2:5; 1 Pet 1:19-20.<br/>\n<b><sup>b</sup></b> Acts 3:22.  <b><sup>c</sup></b> Heb 5:5-6.<br/>\n<b><sup>d</sup></b> Psa 2:6; Luke 1:33.<br/>\n<b><sup>e</sup></b> Eph 5:23.  <b><sup>f</sup></b> Heb 1:2.<br/>\n<b><sup>g</sup></b> Acts 17:31.<br/>\n<b><sup>h</sup></b> Psa 22:30; Isa 53:10; John 17:6.<br/>\n<b><sup>i</sup></b> Isa 55:4-5; 1 Cor 1:30; 1 Tim 2:6.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. The Son of God, the second person in the Trinity, being very and eternal God, of one substance, and equal with the Father, did, when the fulness of time was come, take upon him man's nature,<b><sup>a</sup></b> with all the essential properties and common infirmities thereof, yet without sin:<b><sup>b</sup></b> being conceived by the power of the Holy Ghost in the womb of the Virgin Mary, of her substance.<b><sup>c</sup></b> So that two whole, perfect, and distinct natures, the Godhead and the manhood, were inseparably joined together in one person, without conversion, composition, or confusion.<b><sup>d</sup></b> Which person is very God and very man, yet one Christ, the only mediator between God and man.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 1:1, 14; Gal 4:4; Phil 2:6; 1 John 5:20.<br/>\n<b><sup>b</sup></b> Heb 2:14, 16-17; 4:15.<br/>\n<b><sup>c</sup></b> Luke 1:27, 31, 35; Gal 4:4.<br/>\n<b><sup>d</sup></b> Luke 1:35; Rom 9:5; Col 2:9; 1 Tim 3:16; 1 Pet 3:18.<br/>\n<b><sup>e</sup></b> Rom 1:3-4; 1 Tim 2:5.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. The Lord Jesus, in his human nature thus united to the divine, was sanctified and anointed with the Holy Spirit above measure;<b><sup>a</sup></b> having in him all the treasures of wisdom and knowledge,<b><sup>b</sup></b> in whom it pleased the Father that all fulness should dwell;<b><sup>c</sup></b> to the end that, being holy, harmless, undefiled, and full of grace and truth,<b><sup>d</sup></b> he might be thoroughly furnished to execute the office of a mediator and surety.<b><sup>e</sup></b> Which office he took not unto himself, but was thereunto called by his Father,<b><sup>f</sup></b> who put all power and judgment into his hand, and gave him commandment to execute the same.<b><sup>g</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 45:7; John 3:34.<br/>\n<b><sup>b</sup></b> Col 2:3.<br/>\n<b><sup>c</sup></b> Col 1:19.<br/>\n<b><sup>d</sup></b> John 1:14; Heb 7:26.<br/>\n<b><sup>e</sup></b> Acts 10:38; Heb 7:22; 12:24.<br/>\n<b><sup>f</sup></b> Heb 5:4-5.<br/>\n<b><sup>g</sup></b> Mat 28:18; John 5:22, 27; Acts 2:36.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. This office the Lord Jesus did most willingly undertake,<b><sup>a</sup></b> which, that he might discharge, he was made under the law,<b><sup>b</sup></b> and did perfectly fulfill it;<b><sup>c</sup></b> endured most grievous torments immediately in his soul,<b><sup>d</sup></b> and most painful sufferings in his body;<b><sup>e</sup></b> was crucified, and died;<b><sup>f</sup></b>was buried, and remained under the power of death, yet saw no corruption.<b><sup>g</sup></b> On the third day he arose from the dead,<b><sup>h</sup></b> with the same body in which he suffered;<b><sup>i</sup></b> with which also he ascended into heaven, and there sitteth at the right hand of his Father,<b><sup>j</sup></b> making intercession;<b><sup>k</sup></b>and shall return to judge men and angels at the end of the world.<b><sup>l</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 40:7-8 with Heb 10:5-10; John 10:18; Phil 2:8.<br/>\n<b><sup>b</sup></b> Gal 4:4.  <b><sup>c</sup></b> Mat 3:15; 5:17.<br/>\n<b><sup>d</sup></b> Mat 26:37-38; 27:46; Luke 22:44.<br/>\n<b><sup>e</sup></b> Matthew 26-27 throughout.<br/>\n<b><sup>f</sup></b> Phil 2:8.<br/>\n<b><sup>g</sup></b> Acts 2:23-24, 27; 13:37; Rom 6:9.<br/>\n<b><sup>h</sup></b> 1 Cor 15:3-4.  <b><sup>i</sup></b> John 20:25, 27.<br/>\n<b><sup>j</sup></b> Mark 16:19.<br/>\n<b><sup>k</sup></b> Rom 8:34; Heb 7:25; 9:24.<br/>\n<b><sup>l</sup></b> Mat 13:40-42; Acts 1:11; 10:42; Rom 14:9-10; 2 Pet 2:4; Jude 1:6.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. The Lord Jesus, by his perfect obedience and sacrifice of himself, which he through the eternal Spirit once offered up unto God, hath fully satisfied the justice of his Father,<b><sup>a</sup></b> and purchased not only reconciliation, but an everlasting inheritance in the kingdom of heaven, for all those whom the Father hath given unto him.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 3:25-26; 5:19; Eph 5:2; Heb 9:14, 16; 10:14.<br/>\n<b><sup>b</sup></b> Dan 9:24, 26; John 17:2; Eph 1:11, 14; Col 1:19-20; Heb 9:12, 15.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. Although the work of redemption was not actually wrought by Christ till after his incarnation, yet the virtue, efficacy, and benefits thereof were communicated unto the elect, in all ages successively from the beginning of the world, in and by those promises, types, and sacrifices, wherein he was revealed, and signified to be the seed of the woman which should bruise the serpent's head, and the Lamb slain from the beginning of the world, being yesterday and today the same, and forever.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 3:15; Gal 4:4-5; Heb 13:8; Rev 13:8.</div>"
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. Christ, in the work of mediation, acteth according to both natures; by each nature doing that which is proper to itself;<b><sup>a</sup></b> yet, by reason of the unity of the person, that which is proper to one nature is sometimes, in Scripture, attributed to the person denominated by the other nature.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Heb 9:14; 1 Pet 3:18.<br/>\n<b><sup>b</sup></b> John 3:13; Acts 20:28; 1 John 3:16.</div>"
        },
        {
          "paragraphNumber": 8,
          "text": "<p>VIII. To all those for whom Christ hath purchased redemption he doth certainly and effectually apply and communicate the same;<b><sup>a</sup></b> making intercession for them,<b><sup>b</sup></b> and revealing unto them, in and by the Word, the mysteries of salvation;<b><sup>c</sup></b> effectually persuading them by his Spirit to believe and obey; and governing their hearts by his Word and Spirit;<b><sup>d</sup></b> overcoming all their enemies by his almighty power and wisdom, in such manner and ways as are most consonant to his wonderful and unsearchable dispensation.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 6:37, 39; 10:15-16.<br/>\n<b><sup>b</sup></b> Rom 8:34; 1 John 2:1-2.<br/>\n<b><sup>c</sup></b> John 15:13, 15; 17:6; Eph 1:7-9.<br/>\n<b><sup>d</sup></b> John 14:16; 17:17; Rom 8:9, 14; 15:18-19; 2 Cor 4:13; Heb 12:2.<br/>\n<b><sup>e</sup></b> Psa 110:1; Mal 4:2-3; 1 Cor 15:25-26; Col 2:15.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 9: Of Free Will",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. God hath endued the will of man with that natural liberty, that is neither forced nor by any absolute necessity of nature determined to good or evil.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Deut 30:19; Mat 17:12; James 1:14.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. Man, in his state of innocency, had freedom and power to will and to do that which is good and well-pleasing to God,<b><sup>a</sup></b> but yet mutably, so that he might fall from it.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 1:26; Ecc 7:29.<br/>\n<b><sup>b</sup></b> Gen 2:16-17; 3:6.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Man, by his fall into a state of sin, hath wholly lost all ability of will to any spiritual good accompanying salvation;<b><sup>a</sup></b> so as a natural man, being altogether averse from that good,<b><sup>b</sup></b> and dead in sin,<b><sup>c</sup></b> is not able, by his own strength, to convert himself, or to prepare himself thereunto.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 15:5; Rom 5:6; 8:7.<br/>\n<b><sup>b</sup></b> Rom 3:10, 12.<br/>\n<b><sup>c</sup></b> Eph 2:1, 5; Col 2:13.<br/>\n<b><sup>d</sup></b> John 6:44, 65; 1 Cor 2:14; Eph 2:2-5; Titus 3:3-5.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. When God converts a sinner, and translates him into the state of grace, he freeth him from his natural bondage under sin,<b><sup>a</sup></b> and by his grace alone enables him freely to will and to do that which is spiritually good;<b><sup>b</sup></b> yet so as that, by reason of his remaining corruption, he doth not perfectly, nor only, will that which is good, but doth also will that which is evil.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 8:34, 36; Col 1:13.<br/>\n<b><sup>b</sup></b> Rom 6:18, 22; Phil 2:13.<br/>\n<b><sup>c</sup></b> Rom 7:15, 18-19, 21, 23; Gal 5:17.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. The will of man is made perfectly and immutably free to good alone, in the state of glory only.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Eph 4:13; Heb 12:23; 1 John 3:2; Jude 1:24.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 10: Of Effectual Calling",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. All those whom God hath predestinated unto life, and those only, he is pleased, in his appointed and accepted time, effectually to call,<b><sup>a</sup></b> by his Word and Spirit,<b><sup>b</sup></b> out of that state of sin and death, in which they are by nature, to grace and salvation by Jesus Christ;<b><sup>c</sup></b>enlightening their minds, spiritually and savingly, to understand the things of God;<b><sup>d</sup></b> taking away their heart of stone, and giving unto them an heart of flesh;<b><sup>e</sup></b> renewing their wills, and by his almighty power determining them to that which is good,<b><sup>f</sup></b> and effectually drawing them to Jesus Christ;<b><sup>g</sup></b> yet so as they come most freely, being made willing by his grace.<b><sup>h</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 8:30; 11:7; Eph 1:10-11.<br/>\n<b><sup>b</sup></b> 2 Cor 3:3, 6; 2 Thes 2:13-14.<br/>\n<b><sup>c</sup></b> Rom 8:2; Eph 2:1-5; 2 Tim 1:9-10.<br/>\n<b><sup>d</sup></b> Acts 26:18; 1 Cor 2:10, 12; Eph 1:17-18.<br/>\n<b><sup>e</sup></b> Ezek 36:26.<br/>\n<b><sup>f</sup></b> Deut 30:6; Ezek 11:19; 36:27; Phil 2:13.<br/>\n<b><sup>g</sup></b> John 6:44-45; Eph 1:19.<br/>\n<b><sup>h</sup></b> Psa 110:3; Song of Songs 1:4; John 6:37; Rom 6:16-18.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. This effectual call is of God's free and special grace alone, not from anything at all foreseen in man;<b><sup>a</sup></b> who is altogether passive therein, until, being quickened and renewed by the Holy Spirit,<b><sup>b</sup></b> he is thereby enabled to answer this call, and to embrace the grace offered and conveyed in it.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 9:11; Eph 2:4-5, 8-9; 2 Tim 1:9; Titus 3:4-5.<br/>\n<b><sup>b</sup></b> Rom 8:7; 1 Cor 2:14; Eph 2:5.<br/>\n<b><sup>c</sup></b> Ezek 36:27; John 5:25; 6:37.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Elect infants, dying in infancy, are regenerated and saved by Christ through the Spirit,<b><sup>a</sup></b> who worketh when, and where, and how he pleaseth.<b><sup>b</sup></b> So also are all other elect persons who are incapable of being outwardly called by the ministry of the Word.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Luke 18:15-16 and John 3:3, 5 and Acts 2:38-39 and Rom 8:9 and 1 John 5:12 compared together.<br/>\n<b><sup>b</sup></b> John 3:8.<br/>\n<b><sup>c</sup></b> Acts 4:12; 1 John 5:12.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. Others, not elected, although they may be called by the ministry of the Word,<b><sup>a</sup></b> and may have some common operations of the Spirit,<b><sup>b</sup></b> yet they never truly come unto Christ, and therefore cannot be saved:<b><sup>c</sup></b> much less can men, not professing the Christian religion, be saved in any other way whatsoever, be they never so diligent to frame their lives according to the light of nature and the law of that religion they do profess;<b><sup>d</sup></b> and to assert and maintain that they may is very pernicious, and to be detested.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 22:14.<br/>\n<b><sup>b</sup></b> Mat 7:22; 13:20-21; Heb 6:4-5.<br/>\n<b><sup>c</sup></b> John 6:64-66; 8:24.<br/>\n<b><sup>d</sup></b> John 4:22; 14:6; 17:3; Acts 4:12; Eph 2:12.<br/>\n<b><sup>e</sup></b> 1 Cor 16:22; Gal 1:6-8; 2 John 1:9-11.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 11: Of Justification",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Those whom God effectually calleth he also freely justifieth;<b><sup>a</sup></b> not by infusing righteousness into them, but by pardoning their sins, and by accounting and accepting their persons as righteous: not for anything wrought in them, or done by them, but for Christ's sake alone; nor by imputing faith itself, the act of believing, or any other evangelical obedience to them, as their righteousness; but by imputing the obedience and satisfaction of Christ unto them,<b><sup>b</sup></b>they receiving and resting on him and his righteousness by faith; which faith they have not of themselves, it is the gift of God.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 3:24; 8:30.<br/>\n<b><sup>b</sup></b> Jer 23:6; Rom 3:22, 24-25, 27-28; 4:5-8; 5:17-19; 1 Cor 1:30-31; 2 Cor 5:19, 21; Eph 1:7; Titus 3:5, 7.<br/>\n<b><sup>c</sup></b> Acts 10:44; 13:38-39; Gal 2:16; Eph 2:7-8; Phil 3:9.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. Faith, thus receiving and resting on Christ and his righteousness, is the alone instrument of justification;<b><sup>a</sup></b> yet is it not alone in the person justified, but is ever accompanied with all other saving graces, and is no dead faith, but worketh by love.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 1:12; Rom 3:28; 5:1.<br/>\n<b><sup>b</sup></b> Gal 5:6; James 2:17, 22, 26.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Christ, by his obedience and death, did fully discharge the debt of all those that are thus justified, and did make a proper, real, and full satisfaction to his Father's justice in their behalf.<b><sup>a</sup></b> Yet inasmuch as he was given by the Father for them,<b><sup>b</sup></b> and his obedience and satisfaction accepted in their stead,<b><sup>c</sup></b> and both freely, not for anything in them, their justification is only of free grace;<b><sup>d</sup></b> that both the exact justice and rich grace of God might be glorified in the justification of sinners.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Isa 53:4-6, 10-12; Dan 9:24, 26; Rom 5:8-10, 19; 1 Tim 2:5-6; Heb 10:10, 14.<br/>\n<b><sup>b</sup></b> Rom 8:32.<br/>\n<b><sup>c</sup></b> Mat 3:17; 2 Cor 5:21; Eph 5:2.<br/>\n<b><sup>d</sup></b> Rom 3:24; Eph 1:7.<br/>\n<b><sup>e</sup></b> Rom 3:26; Eph 2:7.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. God did, from all eternity, decree to justify all the elect,<b><sup>a</sup></b> and Christ did, in the fulness of time, die for their sins, and rise again for their justification:<b><sup>b</sup></b> nevertheless, they are not justified until the Holy Spirit doth, in due time, actually apply Christ unto them.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 8:30; Gal 3:8; 1 Pet 1:2, 19-20.<br/>\n<b><sup>b</sup></b> Rom 4:25; Gal 4:4; 1 Tim 2:6.<br/>\n<b><sup>c</sup></b> Gal 2:16; Col 1:21-22; Titus 3:4-7.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. God doth continue to forgive the sins of those that are justified;<b><sup>a</sup></b> and although they can never fall from the state of justification,<b><sup>b</sup></b> yet they may by their sins fall under God's fatherly displeasure, and not have the light of his countenance restored unto them, until they humble themselves, confess their sins, beg pardon, and renew their faith and repentance.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 6:12; 1 John 1:7, 9; 2:1-2.<br/>\n<b><sup>b</sup></b> Luke 22:32; John 10:28; Heb 10:14.<br/>\n<b><sup>c</sup></b> Psa 32:5; 51:7-12; 89:31-33; Mat 26:75; Luke 1:20; 1 Cor 11:30, 32.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. The justification of believers under the Old Testament was, in all these respects, one and the same with the justification of believers under the New Testament.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 4:22-24; Gal 3:9, 13-14; Heb 13:8.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 12: Of Adoption",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. All those that are justified God vouchsafeth, in and for his only Son Jesus Christ, to make partakers of the grace of adoption;<b><sup>a</sup></b> by which they are taken into the number, and enjoy the liberties and privileges of the children of God;<b><sup>b</sup></b> have his name put upon them;<b><sup>c</sup></b> receive the Spirit of adoption;<b><sup>d</sup></b> have access to the throne of grace with boldness;<b><sup>e</sup></b> are enabled to cry, Abba, Father;<b><sup>f</sup></b> are pitied,<b><sup>g</sup></b> protected,<b><sup>h</sup></b> provided for,<b><sup>i</sup></b> and chastened by him as by a father;<b><sup>j</sup></b> yet never cast off,<b><sup>k</sup></b> but sealed to the day of redemption,<b><sup>l</sup></b> and inherit the promises,<b><sup>m</sup></b> as heirs of everlasting salvation.<b><sup>n</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gal 4:4-5; Eph 1:5.<br/>\n<b><sup>b</sup></b> John 1:12; Rom 8:17.<br/>\n<b><sup>c</sup></b> Jer 14:9; 2 Cor 6:18; Rev 3:12.<br/>\n<b><sup>d</sup></b> Rom 8:15.<br/>\n<b><sup>e</sup></b> Rom 5:2; Eph 3:12.<br/>\n<b><sup>f</sup></b> Gal 4:6.\n<b><sup>g</sup></b> Psa 103:13.<br/>\n<b><sup>h</sup></b> Prov 14:26.<br/>\n<b><sup>i</sup></b> Mat 6:30, 32; 1 Pet 5:7.<br/>\n<b><sup>j</sup></b> Heb 12:6.  <b><sup>k</sup></b> Lam 3:31.<br/>\n<b><sup>l</sup></b> Eph 4:30.  <b><sup>m</sup></b> Heb 6:12.<br/>\n<b><sup>b</sup></b> Heb 1:14; 1 Pet 1:3-4.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 13: Of Sanctification",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. They who are effectually called and regenerated, having a new heart and a new spirit created in them, are further sanctified, really and personally, through the virtue of Christ's death and resurrection,<b><sup>a</sup></b> by his Word and Spirit dwelling in them;<b><sup>b</sup></b> the dominion of the whole body of sin is destroyed,<b><sup>c</sup></b> and the several lusts thereof are more and more weakened and mortified,<b><sup>d</sup></b> and they more and more quickened and strengthened, in all saving graces,<b><sup>e</sup></b> to the practice of true holiness, without which no man shall see the Lord.<b><sup>f</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Acts 20:32; Rom 6:5-6; 1 Cor 6:11; Phil 3:10.<br/><b><sup>b</sup></b> John 17:17; Eph 5:26; 2 Thes 2:13.<br/><b><sup>c</sup></b> Rom 6:6, 14.<br/><b><sup>d</sup></b> Rom 8:13; Gal 5:24.<br/><b><sup>e</sup></b> Eph 3:16-19; Col 1:11.<br/><b><sup>f</sup></b> 2 Cor 7:1; Heb 12:14."
        },
        {
          "paragraphNumber": 2,
          "text": "II. This sanctification is throughout in the whole man,<b><sup>a</sup></b> yet imperfect in this life; there abideth still some remnants of corruption in every part,<b><sup>b</sup></b> whence ariseth a continual and irreconcilable war, the flesh lusting against the spirit, and the spirit against the flesh.<b><sup>c</sup></b></div>",
          "footnotes": "<b><sup>a</sup></b> 1 Thes 5:23.<br/>\n<b><sup>b</sup></b> Rom 7:18, 23; Phil 3:12; 1 John 1:10.<br/>\n<b><sup>c</sup></b> Gal 5:17; 1 Pet 2:11.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. In which war, although the remaining corruption for a time may much prevail,<b><sup>a</sup></b> yet, through the continual supply of strength from the sanctifying Spirit of Christ, the regenerate part doth overcome;<b><sup>b</sup></b> and so the saints grow in grace,<b><sup>c</sup></b> perfecting holiness in the fear of God.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 7:23.<br/>\n<b><sup>b</sup></b> Rom 6:14; Eph 4:15-16; 1 John 5:4.<br/>\n<b><sup>c</sup></b> 2 Cor 3:18; 2 Pet 3:18.<br/>\n<b><sup>d</sup></b> 2 Cor 7:1.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 14: Of Saving Faith",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. The grace of faith, whereby the elect are enabled to believe to the saving of their souls,<b><sup>a</sup></b> is the work of the Spirit of Christ in their hearts,<b><sup>b</sup></b> and is ordinarily wrought by the ministry of the Word;<b><sup>c</sup></b> by which also, and by the administration of the sacraments and prayer, it is increased and strengthened.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Heb 10:39.<br/>\n<b><sup>b</sup></b> Eph 1:17-19; 2:8; 2 Cor 4:13.<br/>\n<b><sup>c</sup></b> Rom 10:14, 17.<br/>\n<b><sup>d</sup></b> Luke 17:5; Acts 20:32; Rom 1:16-17; 4:11; 1 Pet 2:2.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. By this faith a Christian believeth to be true whatsoever is revealed in the Word, for the authority of God himself speaking therein;<b><sup>a</sup></b> and acteth differently upon that which each particular passage thereof containeth; yielding obedience to the commands,<b><sup>b</sup></b> trembling at the threatenings,<b><sup>c</sup></b> and embracing the promises of God for this life and that which is to come.<b><sup>d</sup></b> But the principal acts of saving faith are accepting, receiving, and resting upon Christ alone for justification, sanctification, and eternal life, by virtue of the covenant of grace.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 4:42; Acts 24:14; 1 Thes 2:13; 1 John 5:10.<br/>\n<b><sup>b</sup></b> Rom 16:26.<br/>\n<b><sup>c</sup></b> Isa 66:2.<br/>\n<b><sup>d</sup></b> 1 Tim 4:8; Heb 11:13.<br/>\n<b><sup>e</sup></b> John 1:12; Acts 15:11; 16:31; Gal 2:20.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. This faith is different in degrees, weak or strong;<b><sup>a</sup></b> may be often and many ways assailed and weakened, but gets the victory;<b><sup>b</sup></b> growing up in many to the attainment of a full assurance through Christ,<b><sup>c</sup></b> who is both the author and finisher of our faith.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 6:30; 8:10; Rom 4:19-20; Heb 5:13-14.<br/>\n<b><sup>b</sup></b> Luke 22:31-32; Eph 6:16; 1 John 5:4-5.<br/>\n<b><sup>c</sup></b> Col 2:2; Heb 6:11-12; 10:22.<br/>\n<b><sup>d</sup></b> Heb 12:2.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 15: Of Repentance unto Life",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Repentance unto life is an evangelical grace,<b><sup>a</sup></b> the doctrine whereof is to be preached by every minister of the gospel, as well as that of faith in Christ.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Zec 12:10; Acts 11:18.<br/>\n<b><sup>b</sup></b> Luke 24:47; Mark 1:15; Acts 20:21.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. By it a sinner, out of the sight and sense, not only of the danger, but also of the filthiness and odiousness of his sins, as contrary to the holy nature and righteous law of God, and upon the apprehension of his mercy in Christ to such as are penitent, so grieves for and hates his sins as to turn from them all unto God,<b><sup>a</sup></b> purposing and endeavoring to walk with him in all the ways of his commandments.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 51:4; 119:128; Isa 30:22; Jer 31:18-19; Ezek 18:30-31; 36:31; Joel 2:12-13; Amos 5:15; 2 Cor 7:11.<br/>\n<b><sup>b</sup></b> 2 Kings 23:25; Psa 119:6, 59, 106; Luke 1:6.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Although repentance be not to be rested in as any satisfaction for sin, or any cause of the pardon thereof,<b><sup>a</sup></b> which is the act of God's free grace in Christ;<b><sup>b</sup></b> yet is it of such necessity to all sinners that none may expect pardon without it.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Ezek 16:61-63; 36:31-32.<br/>\n<b><sup>b</sup></b> Hosea 14:2, 4; Rom 3:24; Eph 1:7.<br/>\n<b><sup>c</sup></b> Luke 13:3, 5; Acts 17:30-31.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. As there is no sin so small but it deserves damnation,<b><sup>a</sup></b> so there is no sin so great that it can bring damnation upon those who truly repent.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 12:36; Rom 5:12; 6:23.<br/>\n<b><sup>b</sup></b> Isa 1:16, 18; 55:7; Rom 8:1.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. Men ought not to content themselves with a general repentance, but it is every man's duty to endeavor to repent of his particular sins particularly.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 19:13; Luke 19:8; 1 Tim 1:13, 15.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. As every man is bound to make private confession of his sins to God, praying for the pardon thereof,<b><sup>a</sup></b> upon which, and the forsaking of them, he shall find mercy;<b><sup>b</sup></b> so he that scandalizeth his brother, or the Church of Christ, ought to be willing, by a private or public confession and sorrow for his sin, to declare his repentance to those that are offended,<b><sup>c</sup></b> who are thereupon to be reconciled to him, and in love to receive him.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 32:5-6; 51:4-5, 7, 9, 14.<br/>\n<b><sup>b</sup></b> Prov 28:13; 1 John 1:9.<br/>\n<b><sup>c</sup></b> Psa 51 throughout; Josh 7:19; Luke 17:3-4; James 5:16.<br/>\n<b><sup>d</sup></b> 2 Cor 2:8.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 16: Of Good Works",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Good works are only such as God hath commanded in his holy Word,<b><sup>a</sup></b> and not such as, without the warrant thereof, are devised by men out of blind zeal, or upon any pretense of good intention.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Micah 6:8; Rom 12:2; Heb 13:21.<br/>\n<b><sup>b</sup></b> 1 Sam 15:21-23; Isa 29:13; Mat 15:9; John 16:2; Rom 10:2; 1 Pet 1:18.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. These good works, done in obedience to God's commandments, are the fruits and evidences of a true and lively faith;<b><sup>a</sup></b> and by them believers manifest their thankfulness,<b><sup>b</sup></b>strengthen their assurance,<b><sup>c</sup></b> edify their brethren,<b><sup>d</sup></b> adorn the profession of the gospel,<b><sup>e</sup></b> stop the mouths of the adversaries,<b><sup>f</sup></b> and glorify God,<b><sup>g</sup></b> whose workmanship they are, created in Christ Jesus thereunto,<b><sup>h</sup></b> that, having their fruit unto holiness, they may have the end, eternal life.<b><sup>i</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> James 2:18, 22.<br/>\n<b><sup>b</sup></b> Psa 116:12-13; 1 Pet 2:9.<br/>\n<b><sup>c</sup></b> 2 Pet 1:5-10; 1 John 2:3, 5.<br/>\n<b><sup>d</sup></b> Mat 5:16; 2 Cor 9:2.<br/>\n<b><sup>e</sup></b> 1 Tim 6:1; Titus 2:5, 9-12.<br/>\n<b><sup>f</sup></b> 1 Pet 2:15.<br/>\n<b><sup>g</sup></b> John 15:8; Phil 1:11; 1 Pet 2:12.<br/>\n<b><sup>h</sup></b> Eph 2:10.<br/>\n<b><sup>i</sup></b> Rom 6:22.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Their ability to do good works is not at all of themselves, but wholly from the Spirit of Christ.<b><sup>a</sup></b> And that they may be enabled thereunto, besides the graces they have already received, there is required an actual influence of the same Holy Spirit to work in them to will and to do of his good pleasure;<b><sup>b</sup></b> yet are they not hereupon to grow negligent, as if they were not bound to perform any duty unless upon a special motion of the Spirit; but they ought to be diligent in stirring up the grace of God that is in them.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Ezek 36:26-27; John 15:4-6.<br/>\n<b><sup>b</sup></b> Phil 2:13; 4:13; 2 Cor 3:5.<br/>\n<b><sup>c</sup></b> Isa 64:7; Acts 26:6-7; Phil 2:12; 2 Tim 1:6; Heb 6:11-12; 2 Pet 1:3, 5, 10-11; Jude 1:20-21.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. They who in their obedience attain to the greatest height which is possible in this life, are so far from being able to supererogate and to do more than God requires, as that they fall short of much which in duty they are bound to do.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Neh 13:22; Job 9:2-3; Luke 17:10; Gal 5:17.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. We cannot, by our best works, merit pardon of sin, or eternal life at the hand of God, by reason of the great disproportion that is between them and the glory to come, and the infinite distance that is between us and God, whom by them we can neither profit nor satisfy for the debt of our former sins;<b><sup>a</sup></b> but when we have done all we can, we have done but our duty, and are unprofitable servants;<b><sup>b</sup></b> and because, as they are good, they proceed from his Spirit;<b><sup>c</sup></b> and as they are wrought by us, they are defiled and mixed with so much weakness and imperfection that they cannot endure the severity of God's judgment.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Job 22:2-3; 35:7-8; Psa 16:2; Rom 3:20; 4:2, 4, 6; 8:18; Eph 2:8-9; Titus 3:5-7.<br/>\n<b><sup>b</sup></b> Luke 17:10.<br/>\n<b><sup>c</sup></b> Gal 5:22-23.<br/>\n<b><sup>d</sup></b> Psa 130:3; 143:2; Isa 64:6; Rom 7:15, 18; Gal 5:17.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. Yet notwithstanding, the persons of believers being accepted through Christ, their good works also are accepted in him,<b><sup>a</sup></b> not as though they were in this life wholly unblamable and unreprovable in God's sight;<b><sup>b</sup></b> but that he, looking upon them in his Son, is pleased to accept and reward that which is sincere, although accompanied with many weaknesses and imperfections.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 4:4 with Heb 11:4; Exod 28:38; Eph 1:6; 1 Pet 2:5.<br/>\n<b><sup>b</sup></b> Job 9:20; Psa 143:2.<br/>\n<b><sup>c</sup></b> Mat 25:21, 23; 2 Cor 8:12; Heb 6:10; 13:20-21.</div>"
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. Works done by unregenerate men, although for the matter of them they may be things which God commands, and of good use both to themselves and others;<b><sup>a</sup></b> yet because they proceed not from a heart purified by faith,<b><sup>b</sup></b> nor are done in a right manner, according to the Word,<b><sup>c</sup></b> nor to a right end, the glory of God;<b><sup>d</sup></b> they are therefore sinful, and cannot please God, or make a man meet to receive grace from God.<b><sup>e</sup></b> And yet their neglect of them is more sinful and displeasing unto God.<b><sup>f</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Kings 21:27, 29; 2 Kings 10:30-31; Phil 1:15-16, 18.<br/>\n<b><sup>b</sup></b> Gen 4:3-5 with Heb 11:4, 6.<br/>\n<b><sup>c</sup></b> Isa 1:12; 1 Cor 13:3.<br/>\n<b><sup>d</sup></b> Mat 6:2, 5, 16.<br/>\n<b><sup>e</sup></b> Amos 5:21-22; Hosea 1:4; Hag 2:14; Rom 9:16; Titus 1:15; 3:5.<br/>\n<b><sup>f</sup></b> Job 21:14-15; Psa 14:4; 36:3; Mat 23:23; 25:41-45.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 17: Of Perseverance of the Saints",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. They whom God hath accepted in his Beloved, effectually called and sanctified by his Spirit, can neither totally nor finally fall away from the state of grace; but shall certainly persevere therein to the end, and be eternally saved.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 10:28-29; Phil 1:6; 1 Pet 1:5, 9; 2 Pet 1:10; 1 John 3:9.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. This perseverance of the saints depends, not upon their own free will, but upon the immutability of the decree of election, flowing from the free and unchangeable love of God the Father;<b><sup>a</sup></b> upon the efficacy of the merit and intercession of Jesus Christ;<b><sup>b</sup></b> the abiding of the Spirit and of the seed of God within them;<b><sup>c</sup></b> and the nature of the covenant of grace:<b><sup>d</sup></b> from all which ariseth also the certainty and infallibility thereof.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Jer 31:3; 2 Tim 2:18-19.<br/>\n<b><sup>b</sup></b> Luke 22:32; John 17:11, 24; Heb 7:25; 9:12-15; 10:10, 14; 13:20-21; Rom 8:33-39.<br/>\n<b><sup>c</sup></b> John 14:16-17; 1 John 2:27; 3:9.<br/>\n<b><sup>d</sup></b> Jer 32:40.<br/>\n<b><sup>e</sup></b> John 10:28; 2 Thes 3:3; 1 John 2:19.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Nevertheless they may, through the temptations of Satan and of the world, the prevalency of corruption remaining in them, and the neglect of the means of their preservation, fall into grievous sins;<b><sup>a</sup></b> and for a time continue therein:<b><sup>b</sup></b> whereby they incur God's displeasure,<b><sup>c</sup></b> and grieve his Holy Spirit;<b><sup>d</sup></b> come to be deprived of some measure of their graces and comforts;<b><sup>e</sup></b>have their hearts hardened,<b><sup>f</sup></b> and their consciences wounded;<b><sup>g</sup></b> hurt and scandalize others,<b><sup>h</sup></b>and bring temporal judgments upon themselves.<b><sup>i</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 26:70, 72, 74.<br/>\n<b><sup>b</sup></b> Psa 51 title and Psa 51:14.<br/>\n<b><sup>c</sup></b> 2 Sam 11:27; Isa 64:5, 7, 9.<br/>\n<b><sup>d</sup></b> Eph 4:30.<br/>\n<b><sup>e</sup></b> Psa 51:8, 10, 12; Song of Songs 5:2-4, 6; Rev 2:4.<br/>\n<b><sup>f</sup></b> Isa 63:17; Mark 6:52; 16:14.<br/>\n<b><sup>g</sup></b> Psa 32:3-4; 51:8.<br/>\n<b><sup>h</sup></b> 2 Sam 12:14.<br/>\n<b><sup>i</sup></b> Psa 89:31-32; 1 Cor 11:32.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 18: Of the Assurance of Grace and Salvation",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Although hypocrites and other unregenerate men may vainly deceive themselves with false hopes and carnal presumptions of being in the favour of God and estate of salvation,<b><sup>a</sup></b> which hope of theirs shall perish:<b><sup>b</sup></b> yet such as truly believe in the Lord Jesus, and love him in sincerity, endeavoring to walk in all good conscience before him, may in this life be certainly assured that they are in a state of grace,<b><sup>c</sup></b> and may rejoice in the hope of the glory of God, which hope shall never make them ashamed.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Deut 29:19; Job 8:13-14; Micah 3:11; John 8:41.<br/>\n<b><sup>b</sup></b> Mat 7:22-23.<br/>\n<b><sup>c</sup></b> 1 John 2:3; 3:14, 18-19, 21, 24; 5:13.<br/>\n<b><sup>d</sup></b> Rom 5:2, 5.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. This certainty is not a bare conjectural and probable persuasion, grounded upon a fallible hope;<b><sup>a</sup></b> but an infallible assurance of faith, founded upon the divine truth of the promises of salvation,<b><sup>b</sup></b> the inward evidence of those graces unto which these promises are made,<b><sup>c</sup></b> the testimony of the Spirit of adoption witnessing with our spirits that we are the children of God:<b><sup>d</sup></b> which Spirit is the earnest of our inheritance, whereby we are sealed to the day of redemption.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Heb 6:11, 19.<br/>\n<b><sup>b</sup></b> Heb 6:17-18.<br/>\n<b><sup>c</sup></b> 2 Cor 1:12; 2 Pet 1:4-5, 10-11; 1 John 2:3; 3:14.<br/>\n<b><sup>d</sup></b> Rom 8:15-16.<br/>\n<b><sup>e</sup></b> Eph 1:13-14; 4:30; 2 Cor 1:21-22.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. This infallible assurance doth not so belong to the essence of faith, but that a true believer may wait long, and conflict with many difficulties before he be partaker of it:<b><sup>a</sup></b> yet, being enabled by the Spirit to know the things which are freely given him of God, he may, without extraordinary revelation, in the right use of ordinary means, attain thereunto.<b><sup>b</sup></b> And therefore it is the duty of everyone to give all diligence to make his calling and election sure;<b><sup>c</sup></b> that thereby his heart may be enlarged in peace and joy in the Holy Ghost, in love and thankfulness to God, and in strength and cheerfulness in the duties of obedience,<b><sup>d</sup></b> the proper fruits of this assurance: so far is it from inclining men to looseness.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 88 throughout; Psa 77:1-12; Isa 50:10; Mark 9:24; 1 John 5:13.<br/>\n<b><sup>b</sup></b> 1 Cor 2:12; Eph 3:17-19; Heb 6:11-12; 1 John 4:13.<br/>\n<b><sup>c</sup></b> 2 Pet 1:10.<br/>\n<b><sup>d</sup></b> Rom 5:1-2, 5; 14:17; 15:13; Eph 1:3-4; Psa 4:6-7; 119:32.<br/>\n<b><sup>e</sup></b> Psa 130:4; Rom 6:1-2; 8:1, 12; 2 Cor 7:1; Titus 2:11-12, 14; 1 John 1:6-7; 2:1-2; 3:2-3.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. True believers may have the assurance of their salvation divers ways shaken, diminished, and intermitted; as, by negligence in preserving of it; by falling into some special sin, which woundeth the conscience, and grieveth the Spirit; by some sudden or vehement temptation; by God's withdrawing the light of his countenance, and suffering even such as fear him to walk in darkness and to have no light:<b><sup>a</sup></b> yet are they never utterly destitute of that seed of God, and life of faith, that love of Christ and the brethren, that sincerity of heart and conscience of duty, out of which, by the operation of the Spirit, this assurance may in due time be revived,<b><sup>b</sup></b>and by the which, in the meantime, they are supported from utter despair.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 31:22; 51:8, 12, 14; 77:1-10; Psa 88 throughout; Song of Songs 5:2-3, 6; Isa 50:10; Mat 26:69-72; Eph 4:30-31.<br/>\n<b><sup>b</sup></b> Job 13:15; Psa 51:8, 12; 73:15; Isa 50:10; Luke 22:32; 1 John 3:9.<br/>\n<b><sup>c</sup></b> Psa 22:1; Psa 88 throughout; Isa 54:7-10; Jer 32:40; Micah 7:7-9.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 19: Of the Law of God",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. God gave to Adam a law, as a covenant of works, by which he bound him and all his posterity to personal, entire, exact, and perpetual obedience; promised life upon the fulfilling, and threatened death upon the breach of it; and endued him with power and ability to keep it.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 1:26-27 with Gen 2:17; Job 28:28; Ecc 7:29; Rom 2:14-15; 5:12, 19; 10:5; Gal 3:10, 12.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. This law, after his fall, continued to be a perfect rule of righteousness; and, as such, was delivered by God upon mount Sinai in ten commandments, and written in two tables;<b><sup>a</sup></b> the first four commandments containing our duty towards God, and the other six our duty to man.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Exod 34:1; Deut 5:32; 10:4; Rom 13:8-9; James 1:25; 2:8, 10-12.<br/>\n<b><sup>b</sup></b> Mat 22:37-40.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Beside this law, commonly called moral, God was pleased to give to the people of Israel, as a Church under age, ceremonial laws, containing several typical ordinances, partly of worship, prefiguring Christ, his graces, actions, sufferings, and benefits;<b><sup>a</sup></b> and partly holding forth divers instructions of moral duties.<b><sup>b</sup></b> All which ceremonial laws are now abrogated under the New Testament.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gal 4:1-3; Col 2:17; Heb 9 throughout; Heb 10:1.<br/>\n<b><sup>b</sup></b> 1 Cor 5:7; 2 Cor 6:17; Jude 1:23.<br/>\n<b><sup>c</sup></b> Dan 9:27; Eph 2:15-16; Col 2:14, 16-17.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. To them also, as a body politic, he gave sundry judicial laws, which expired together with the State of that people, not obliging any other, now, further than the general equity thereof may require.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 49:10 with 1 Pet 2:13-14; Exod 21 throughout; Exod 22:1-29; Mat 5:17 with Mat 5:38-39; 1 Cor 9:8-10.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. The moral law doth forever bind all, as well justified persons as others, to the obedience thereof;<b><sup>a</sup></b> and that not only in regard of the matter contained in it, but also in respect of the authority of God the Creator who gave it.<b><sup>b</sup></b> Neither doth Christ in the gospel any way dissolve, but much strengthen, this obligation.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 13:8-10; Eph 6:2; 1 John 2:3-4, 7-8.<br/>\n<b><sup>b</sup></b> James 2:10-11.<br/>\n<b><sup>c</sup></b> Mat 5:17-19; Rom 3:31; James 2:8.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. Although true believers be not under the law as a covenant of works, to be thereby justified or condemned;<b><sup>a</sup></b> yet is it of great use to them, as well as to others; in that, as a rule of life, informing them of the will of God and their duty, it directs and binds them to walk accordingly;<b><sup>b</sup></b> discovering also the sinful pollutions of their nature, hearts, and lives;<b><sup>c</sup></b> so as, examining themselves thereby, they may come to further conviction of, humiliation for, and hatred against sin;<b><sup>d</sup></b> together with a clearer sight of the need they have of Christ, and the perfection of his obedience.<b><sup>e</sup></b> It is likewise of use to the regenerate, to restrain their corruptions, in that it forbids sin;<b><sup>f</sup></b> and the threatenings of it serve to show what even their sins deserve, and what afflictions in this life they may expect for them, although freed from the curse thereof threatened in the law.<b><sup>g</sup></b> The promises of it, in like manner, show them God's approbation of obedience, and what blessings they may expect upon the performance thereof;<b><sup>h</sup></b> although not as due to them by the law as a covenant of works:<b><sup>i</sup></b> so as a man's doing good, and refraining from evil, because the law encourageth to the one, and deterreth from the other, is no evidence of his being under the law, and not under grace.<b><sup>j</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gal 3:21.<br/>\n<b><sup>b</sup></b> Ezek 36:27; Heb 8:10 with Jer 31:33.</div>"
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. Neither are the forementioned uses of the law contrary to the grace of the gospel, but do sweetly comply with it:<b><sup>a</sup></b> the Spirit of Christ subduing and enabling the will of man to do that freely and cheerfully which the will of God, revealed in the law, requireth to be done.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Acts 13:39; Rom 6:14; 8:1; Gal 2:16; 3:13; 4:4-5.<br/>\n<b><sup>b</sup></b> Psa 119:4-6; Rom 7:12, 22, 25; 1 Cor 7:19; Gal 5:14, 16, 18-23.<br/>\n<b><sup>c</sup></b> Rom 3:20; 7:7.<br/>\n<b><sup>d</sup></b> Rom 7:9, 14, 24; James 1:23-25.<br/>\n<b><sup>e</sup></b> Rom 7:24-25; 8:3-4; Gal 3:24.<br/>\n<b><sup>f</sup></b> Psa 119:101, 104, 128; James 2:11.<br/>\n<b><sup>g</sup></b> Ezra 9:13-14; Psa 89:30-34.<br/>\n<b><sup>h</sup></b> Lev 26:1, 10; 26:14 with 2 Cor 6:16; Psa 19:11; 37:11 with Mat 5:5; Eph 6:2-3.<br/>\n<b><sup>i</sup></b> Luke 17:10; Gal 2:16.<br/>\n<b><sup>j</sup></b> Rom 6:12, 14; Heb 12:28-29; 1 Pet 3:8-12 with Psa 34:12-16.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 20: Of Christian Liberty, and Liberty of Conscience",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. The liberty which Christ hath purchased for believers under the gospel consists in their freedom from the guilt of sin, the condemning wrath of God, the curse of the moral law;<b><sup>a</sup></b> and in their being delivered from this present evil world, bondage to Satan, and dominion of sin,<b><sup>b</sup></b>from the evil of afflictions, the sting of death, the victory of the grave, and everlasting damnation;<b><sup>c</sup></b> as also in their free access to God,<b><sup>d</sup></b> and their yielding obedience unto him, not out of slavish fear, but a child-like love and willing mind.<b><sup>e</sup></b> All which were common also to believers under the law;<b><sup>f</sup></b> but under the New Testament the liberty of Christians is further enlarged in their freedom from the yoke of the ceremonial law, to which the Jewish Church was subjected;<b><sup>g</sup></b> and in greater boldness of access to the throne of grace,<b><sup>h</sup></b> and in fuller communications of the free Spirit of God, than believers under the law did ordinarily partake of.<b><sup>i</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gal 3:13; 1 Thes 1:10; Titus 2:14.<br/>\n<b><sup>b</sup></b> Acts 26:18; Rom 6:14; Gal 1:4; Col 1:13.<br/>\n<b><sup>c</sup></b> Psa 119:71; Rom 8:1, 28; 1 Cor 15:54-57.<br/>\n<b><sup>d</sup></b> Rom 5:1-2.<br/>\n<b><sup>e</sup></b> Rom 8:14-15; 1 John 4:18.<br/>\n<b><sup>f</sup></b> Gal 3:9, 14.<br/>\n<b><sup>g</sup></b> Acts 15:10-11; Gal 4:1-3, 6-7; 5:1.<br/>\n<b><sup>h</sup></b> Heb 4:14, 16; 10:19-22.<br/>\n<b><sup>i</sup></b> John 7:38-39; 2 Cor 3:13, 17-18.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. God alone is Lord of the conscience,<b><sup>a</sup></b> and hath left it free from the doctrines and commandments of men which are in anything contrary to his Word, or beside it, in matters of faith or worship.<b><sup>b</sup></b> So that to believe such doctrines, or to obey such commands out of conscience, is to betray true liberty of conscience;<b><sup>c</sup></b> and the requiring of an implicit faith, and an absolute and blind obedience, is to destroy liberty of conscience, and reason also.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 14:4; James 4:12.<br/>\n<b><sup>b</sup></b> Mat 15:9; 23:8-10; Acts 4:19; 5:29; 1 Cor 7:23; 2 Cor 1:24.<br/>\n<b><sup>c</sup></b> Psa 5:1; Gal 1:10; 2:4-5; 5:1; Col 2:20-23.<br/>\n<b><sup>d</sup></b> Isa 8:20; Jer 8:9; Hosea 5:11; John 4:22; Acts 17:11; Rom 10:17; 14:23; Rev 13:12, 16-17.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. They who, upon pretense of Christian liberty, do practice any sin, or cherish any lust, do thereby destroy the end of Christian liberty; which is, that, being delivered out of the hands of our enemies, we might serve the Lord without fear, in holiness and righteousness before him, all the days of our life.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Luke 1:74-75; John 8:34; Gal 5:13; 1 Pet 2:16; 2 Pet 2:19.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. And because the power which God hath ordained, and the liberty which Christ hath purchased, are not intended by God to destroy, but mutually to uphold and preserve one another; they who, upon pretense of Christian liberty, shall oppose any lawful power, or the lawful exercise of it, whether it be civil or ecclesiastical, resist the ordinance of God.<b><sup>a</sup></b> And for their publishing of such opinions, or maintaining of such practices, as are contrary to the light of nature, or to the known principles of Christianity, whether concerning faith, worship, or conversation; or to the power of godliness; or such erroneous opinions or practices as, either in their own nature, or in the manner of publishing or maintaining them, are destructive to the external peace and order which Christ hath established in the Church; they may lawfully be called to account,<b><sup>b</sup></b> and proceeded against by the censures of the Church, and by the power of the Civil Magistrate.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 12:25; Rom 13:1-8; Heb 13:17; 1 Pet 2:13-14, 16.<br/>\n<b><sup>b</sup></b> Rom 1:32 with 1 Cor 5:1, 5, 11, 13; 2 John 1:10-11 and 2 Thes 3:14 and 1 Tim 6:3-5 and Titus 1:10-11, 13 and Titus 3:10 with Mat 18:15-17; 1 Tim 1:19-20; Rev 2:2, 14-15, 20; 3:9.<br/>\n<b><sup>c</sup></b> Deut 13:6-12; 2 Kings 23:5-6, 9, 20-21; 2 Chr 15:12-13, 16; 34:33; Neh 13:15, 17, 21-22, 25, 30; Isa 49:23; Dan 3:29; Zec 13:2-3; Rom 13:3-4 with 2 John 1:10-11; 1 Tim 2:2; Rev 17:12, 16-17.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 21: Of Religious Worship, and the Sabbath Day",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. The light of nature showeth that there is a God, who hath lordship and sovereignty over all; is good, and doeth good unto all; and is therefore to be feared, loved, praised, called upon, trusted in, and served with all the heart, and with all the soul, and with all the might.<b><sup>a</sup></b> But the acceptable way of worshipping the true God is instituted by himself, and so limited to his own revealed will, that he may not be worshipped according to the imaginations and devices of men, or the suggestions of Satan, under any visible representations or any other way not prescribed in the Holy Scripture.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Josh 24:14; Psa 18:3; 31:23; 62:8; 119:68; Jer 10:7; Mark 12:33; Acts 17:24; Rom 1:20; 10:12.<br/>\n<b><sup>b</sup></b> Exod 20:4-6; Deut 4:15-20; 12:32; Mat 4:9-10; 15:9; Acts 17:25; Col 2:23.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. Religious worship is to be given to God, the Father, Son, and Holy Ghost; and to him alone:<b><sup>a</sup></b>not to angels, saints, or any other creature:<b><sup>b</sup></b> and since the fall, not without a Mediator; nor in the mediation of any other but of Christ alone.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 4:10 with John 5:23 and 2 Cor 13:14.<br/>\n<b><sup>b</sup></b> Rom 1:25; Col 2:18; Rev 19:10.<br/>\n<b><sup>c</sup></b> John 14:6; Eph 2:18; Col 3:17; 1 Tim 2:5.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Prayer with thanksgiving, being one special part of religious worship,<b><sup>a</sup></b> is by God required of all men;<b><sup>b</sup></b> and that it may be accepted, it is to be made in the name of the Son,<b><sup>c</sup></b> by the help of his Spirit,<b><sup>d</sup></b> according to his will,<b><sup>e</sup></b> with understanding, reverence, humility, fervency, faith, love, and perseverance;<b><sup>f</sup></b> and, if vocal, in a known tongue.<b><sup>g</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Phil 4:6.  <b><sup>b</sup></b> Psa 65:2.<br/>\n<b><sup>c</sup></b> John 14:13-14; 1 Pet 2:5.<br/>\n<b><sup>d</sup></b> Rom 8:26.  <b><sup>e</sup></b> 1 John 5:14.<br/>\n<b><sup>f</sup></b> Gen 18:27; Psa 47:7; Ecc 5:1-2; Mat 6:12, 14-15; Mark 11:24; Eph 6:18; Col 4:2; Heb 12:28; James 1:6-7; 5:16.<br/>\n<b><sup>g</sup></b> 1 Cor 14:14.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. Prayer is to be made for things lawful,<b><sup>a</sup></b> and for all sorts of men living, or that shall live hereafter;<b><sup>b</sup></b> but not for the dead,<b><sup>c</sup></b> nor for those of whom it may be known that they have sinned the sin unto death.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 John 5:14.<br/>\n<b><sup>b</sup></b> Ruth 4:12; 2 Sam 7:29; John 17:20; 1 Tim 2:1-2.<br/>\n<b><sup>c</sup></b> 2 Sam 12:21-23 with Luke 16:25-26; Rev 14:13.<br/>\n<b><sup>d</sup></b> 1 John 5:16.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. The reading of the Scriptures with godly fear;<b><sup>a</sup></b> the sound preaching;<b><sup>b</sup></b> and conscionable hearing of the Word, in obedience unto God with understanding, faith, and reverence;<b><sup>c</sup></b>singing of psalms with grace in the heart;<b><sup>d</sup></b> as, also, the due administration and worthy receiving of the sacraments instituted by Christ; are all parts of the ordinary religious worship of God:<b><sup>e</sup></b> besides religious oaths,<b><sup>f</sup></b> vows,<b><sup>g</sup></b> solemn fastings,<b><sup>h</sup></b> and thanksgivings upon several occasions;<b><sup>i</sup></b> which are, in their several times and seasons, to be used in an holy and religious manner.<b><sup>j</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Acts 15:21; Rev 1:3.<br/>\n<b><sup>b</sup></b> 2 Tim 4:2.<br/>\n<b><sup>c</sup></b> Isa 66:2; Mat 13:19; Acts 10:33; Heb 4:2; James 1:22.<br/>\n<b><sup>d</sup></b> Eph 5:19; Col 3:16; James 5:13.<br/>\n<b><sup>e</sup></b> Mat 28:19; Acts 2:42; 1 Cor 11:23-29.<br/>\n<b><sup>f</sup></b> Deut 6:13 with Neh 10:29.<br/>\n<b><sup>g</sup></b> Isa 19:21 with Ecc 5:4-5.<br/>\n<b><sup>h</sup></b> Est 4:16; Joel 2:12; Mat 9:15; 1 Cor 7:5.<br/>\n<b><sup>i</sup></b> Est 9:22; Psa 107 throughout.<br/>\n<b><sup>j</sup></b> Heb 12:28.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. Neither prayer, nor any other part of religious worship, is now, under the gospel, either tied unto, or made more acceptable by any place in which it is performed, or towards which it is directed:<b><sup>a</sup></b> but God is to be worshipped everywhere<b><sup>b</sup></b> in spirit and truth;<b><sup>c</sup></b> as in private families<b><sup>d</sup></b> daily,<b><sup>e</sup></b> and in secret each one by himself,<b><sup>f</sup></b> so more solemnly in the public assemblies, which are not carelessly or willfully to be neglected or forsaken, when God, by his Word or providence, calleth thereunto.<b><sup>g</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 4:21.<br/>\n<b><sup>b</sup></b> Mal 1:11; 1 Tim 2:8.<br/>\n<b><sup>c</sup></b> John 4:23-24.<br/>\n<b><sup>d</sup></b> Deut 6:6-7; 2 Sam 6:18, 20; Job 1:5; Jer 10:25; Acts 10:2; 1 Pet 3:7.<br/>\n<b><sup>e</sup></b> Mat 6:11.<br/>\n<b><sup>f</sup></b> Mat 6:6; Eph 6:18.<br/>\n<b><sup>g</sup></b> Isa 56:6-7; Prov 1:20-21, 24; 8:34; Luke 4:16; Acts 2:42; 13:42; Heb 10:25.</div>"
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. As it is of the law of nature that, in general, a due proportion of time be set apart for the worship of God; so, in his Word, by a positive, moral, and perpetual commandment, binding all men in all ages, he hath particularly appointed one day in seven for a Sabbath, to be kept holy unto him:<b><sup>a</sup></b> which, from the beginning of the world to the resurrection of Christ, was the last day of the week; and, from the resurrection of Christ, was changed into the first day of the week,<b><sup>b</sup></b> which in Scripture is called the Lord's day,<b><sup>c</sup></b> and is to be continued to the end of the world, as the Christian Sabbath.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Exod 20:8, 10-11; Isa 56:2, 4, 6-7.<br/>\n<b><sup>b</sup></b> Gen 2:2-3; Acts 20:7; 1 Cor 16:1-2.<br/>\n<b><sup>c</sup></b> Rev 1:10.<br/>\n<b><sup>d</sup></b> Exod 20:8, 10 with Mat 5:17-18.</div>"
        },
        {
          "paragraphNumber": 8,
          "text": "<p>VIII. This Sabbath is then kept holy unto the Lord, when men, after a due preparing of their hearts, and ordering of their common affairs beforehand, do not only observe an holy rest all the day from their own works, words, and thoughts, about their worldly employments and recreations;<b><sup>a</sup></b> but also are taken up the whole time in the public and private exercises of his worship, and in the duties of necessity and mercy.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Exod 20:8; 16:23, 25-26, 29-30; 31:15-17; Isa 58:13; Neh 13:15-22.<br/>\n<b><sup>b</sup></b> Isa 58:13; Mat 12:1-13.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 22: Of Lawful Oaths and Vows",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. A lawful oath is a part of religious worship,<b><sup>a</sup></b> wherein, upon just occasion, the person swearing solemnly calleth God to witness what he asserteth or promiseth; and to judge him according to the truth or falsehood of what he sweareth.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Deut 10:20.<br/>\n<b><sup>b</sup></b> Exod 20:7; Lev 19:12; 2 Chr 6:22-23; 2 Cor 1:23.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. The name of God only is that by which men ought to swear, and therein it is to be used with all holy fear and reverence;<b><sup>a</sup></b> therefore to swear vainly or rashly by that glorious and dreadful name, or to swear at all by any other thing, is sinful, and to be abhorred.<b><sup>b</sup></b> Yet as, in matters of weight and moment, an oath is warranted by the Word of God, under the New Testament, as well as under the Old,<b><sup>c</sup></b> so a lawful oath, being imposed by lawful authority, in such matters ought to be taken.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Deut 6:13.<br/>\n<b><sup>b</sup></b> Exod 20:7; Jer 5:7; Mat 5:34, 37; James 5:12.<br/>\n<b><sup>c</sup></b> Isa 65:16; 2 Cor 1:23; Heb 6:16.<br/>\n<b><sup>d</sup></b> 1 Kings 8:31; Ezra 10:25; Neh 13:25.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Whosoever taketh an oath ought duly to consider the weightiness of so solemn an act, and therein to avouch nothing but what he is fully persuaded is the truth.<b><sup>a</sup></b> Neither may any man bind himself by oath to anything but what is good and just, and what he believeth so to be, and what he is able and resolved to perform.<b><sup>b</sup></b> Yet it is a sin to refuse an oath touching anything that is good and just, being imposed by lawful authority.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Exod 20:7; Jer 4:2.<br/>\n<b><sup>b</sup></b> Gen 24:2-3, 5-6, 8-9.<br/>\n<b><sup>c</sup></b> Exod 22:7-11; Num 5:19, 21; Neh 5:12.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. An oath is to be taken in the plain and common sense of the words, without equivocation or mental reservation.<b><sup>a</sup></b> It cannot oblige to sin; but in anything not sinful, being taken, it binds to performance, although to a man's own hurt:<b><sup>b</sup></b> nor is it to be violated, although made to heretics or infidels.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 24:4; Jer 4:2.<br/>\n<b><sup>b</sup></b> 1 Sam 25:22, 32-34; Psa 15:4.<br/>\n<b><sup>c</sup></b> Ezek 17:16, 18-19; Josh 9:18-19 with 2 Sam 21:1.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. A vow is of the like nature with a promissory oath, and ought to be made with the like religious care, and to be performed with the like faithfulness.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Isa 19:21; Psa 61:8; 66:13-14; Ecc 5:4-6.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. It is not to be made to any creature, but to God alone:<b><sup>a</sup></b> and that it may be accepted, it is to be made voluntarily, out of faith and conscience of duty, in way of thankfulness for mercy received, or for the obtaining of what we want; whereby we more strictly bind ourselves to necessary duties, or to other things, so far and so long as they may fitly conduce thereunto.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 76:11; Jer 44:25-26.<br/>\n<b><sup>b</sup></b> Gen 28:20-22; Deut 23:21, 23; 1 Sam 1:11; Psa 50:14; 66:13-14; 132:2-5.</div>"
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. No man may vow to do anything forbidden in the Word of God, or what would hinder any duty therein commanded, or which is not in his own power, and for the performance whereof he hath no promise or ability from God.<b><sup>a</sup></b> In which respect, Popish monastical vows of perpetual single life, professed poverty, and regular obedience, are so far from being degrees of higher perfection, that they are superstitious and sinful snares, in which no Christian may entangle himself.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Num 30:5, 8, 12-13; Mark 6:26; Acts 23:12, 14.<br/>\n<b><sup>b</sup></b> Mat 19:11-12; 1 Cor 7:2, 9, 23; Eph 4:28; 1 Pet 4:2.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 23: Of the Civil Magistrate",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. God, the Supreme Lord and King of all the world, hath ordained civil magistrates to be under him, over the people, for his own glory and the public good, and to this end hath armed them with the power of the sword, for the defense and encouragement of them that are good, and for the punishment of evil-doers.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 13:1-4; 1 Pet 2:13-14.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. It is lawful for Christians to accept and execute the office of a magistrate when called thereunto;<b><sup>a</sup></b> in the managing whereof, as they ought especially to maintain piety, justice, and peace, according to the wholesome laws of each commonwealth,<b><sup>b</sup></b> so, for that end, they may lawfully, now under the New Testament, wage war upon just and necessary occasion.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Prov 8:15-16; Rom 13:1-2, 4.<br/>\n<b><sup>b</sup></b> 2 Sam 23:3; Psa 2:10-12; 82:3-4; 1 Tim 2:2; 1 Pet 2:13.<br/>\n<b><sup>c</sup></b> Mat 8:9-10; Luke 3:14; Acts 10:1-2; Rom 13:4; Rev 17:14, 16.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Civil magistrates may not assume to themselves the administration of the Word and sacraments; or the power of the keys of the kingdom of heaven; or, in the least, interfere in matters of faith. Yet, as nursing fathers, it is the duty of civil magistrates to protect the church of our common Lord, without giving the preference to any denomination of Christians above the rest, in such a manner that all ecclesiastical persons whatever shall enjoy the full, free, and unquestioned liberty of discharging every part of their sacred functions, without violence or danger. And, as Jesus Christ hath appointed a regular government and discipline in his church, no law of any commonwealth should interfere with, let, or hinder, the due exercise thereof, among the voluntary members of any denomination of Christians, according to their own profession and belief. It is the duty of civil magistrates to protect the person and good name of all their people, in such an effectual manner as that no person be suffered, either upon pretense of religion or of infidelity, to offer any indignity, violence, abuse, or injury to any other person whatsoever: and to take order, that all religious and ecclesiastical assemblies be held without molestation or disturbance.</p>",
          "footnotes": "<b><sup>a</sup></b> 2 Chr 26:18<br/>\n<b><sup>b</sup></b> Isa 49:23<br/>\n<b><sup>c</sup></b> 2 Chr 19:8</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. It is the duty of people to pray for magistrates,<b><sup>a</sup></b> to honor their persons,<b><sup>b</sup></b> to pay them tribute and other dues,<b><sup>c</sup></b> to obey their lawful commands, and to be subject to their authority, for conscience' sake.<b><sup>d</sup></b> Infidelity or difference in religion doth not make void the magistrate's just and legal authority, nor free the people from their due obedience to him:<b><sup>e</sup></b> from which ecclesiastical persons are not exempted;<b><sup>f</sup></b> much less hath the Pope any power or jurisdiction over them in their dominions, or over any of their people; and least of all to deprive them of their dominions or lives, if he shall judge them to be heretics, or upon any other pretense whatsoever.<b><sup>g</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Tim 2:1-2.<br/>\n<b><sup>b</sup></b> 1 Pet 2:17.<br/>\n<b><sup>c</sup></b> Rom 13:6-7.<br/>\n<b><sup>d</sup></b> Rom 13:5; Titus 1:3.<br/>\n<b><sup>e</sup></b> 1 Pet 2:13-14, 16.<br/>\n<b><sup>f</sup></b> 1 Kings 2:35; Acts 25:9-11; Rom 13:1; 2 Pet 2:1, 10-11; Jude 1:8-11.<br/>\n<b><sup>g</sup></b> 2 Thes 2:4; Rev 13:15-17.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 24: Of Marriage and Divorce",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Marriage is to be between one man and one woman: neither is it lawful for any man to have more than one wife, nor for any woman to have more than one husband at the same time.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 2:24; Prov 2:17; Mat 19:5-6.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. Marriage was ordained for the mutual help of husband and wife;<b><sup>a</sup></b> for the increase of mankind with a legitimate issue, and of the Church with an holy seed;<b><sup>b</sup></b> and for preventing of uncleanness.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 2:18.<br/>\n<b><sup>b</sup></b> Mal 2:15.<br/>\n<b><sup>c</sup></b> 1 Cor 7:2, 9.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. It is lawful for all sorts of people to marry who are able with judgment to give their consent.<b><sup>a</sup></b> Yet it is the duty of Christians to marry only in the Lord.<b><sup>b</sup></b> And therefore, such as profess the true reformed religion should not marry with infidels, Papists, or other idolaters: neither should such as are godly be unequally yoked, by marrying with such as are notoriously wicked in their life, or maintain damnable heresies.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 24:57-58; 1 Cor 7:36-38; Heb 13:4; 1 Tim 4:3.<br/>\n<b><sup>b</sup></b> 1 Cor 7:39.<br/>\n<b><sup>c</sup></b> Gen 34:14; Exod 34:16; Deut 7:3-4; 1 Kings 11:4; Neh 13:25-27; Mal 2:11-12; 2 Cor 6:14.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. Marriage ought not to be within the degrees of consanguinity or affinity forbidden in the Word;<b><sup>a</sup></b> nor can such incestuous marriages ever be made lawful by any law of man, or consent of parties, so as those persons may live together as man and wife.<b><sup>b</sup></b> The man may not marry any of his wife's kindred nearer in blood than he may of his own, nor the woman of her husband's kindred nearer in blood than of her own.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Lev 18 throughout; Amos 2:7; 1 Cor 5:1.<br/>\n<b><sup>b</sup></b> Lev 18:24-28; Mark 6:18.<br/>\n<b><sup>c</sup></b> Lev 20:19-21.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. Adultery or fornication, committed after a contract, being detected before marriage, giveth just occasion to the innocent party to dissolve that contract.<b><sup>a</sup></b> In the case of adultery after marriage, it is lawful for the innocent party to sue out a divorce,<b><sup>b</sup></b> and after the divorce to marry another, as if the offending party were dead.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 1:18-20.<br/>\n<b><sup>b</sup></b> Mat 5:31-32.<br/>\n<b><sup>c</sup></b> Mat 19:9; Rom 7:2-3.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. Although the corruption of man be such as is apt to study arguments, unduly to put asunder those whom God hath joined together in marriage; yet nothing but adultery, or such wilful desertion as can no way be remedied by the Church or civil magistrate, is cause sufficient of dissolving the bond of marriage;<b><sup>a</sup></b> wherein a public and orderly course of proceeding is to be observed; and the persons concerned in it, not left to their own wills and discretion in their own case.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 19:6, 8-9; 1 Cor 7:15.<br/>\n<b><sup>b</sup></b> Deut 24:1-4.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 25: Of the Church",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. The catholic or universal Church, which is invisible, consists of the whole number of the elect, that have been, are, or shall be gathered into one, under Christ the head thereof; and is the spouse, the body, the fulness of him that filleth all in all.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Eph 1:10, 22-23; Eph 5:23, 27, 32; Col 1:18.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. The visible Church, which is also catholic or universal under the gospel (not confined to one nation as before under the law) consists of all those, throughout the world, that profess the true religion,<b><sup>a</sup></b> and of their children;<b><sup>b</sup></b> and is the kingdom of the Lord Jesus Christ,<b><sup>c</sup></b> the house and family of God,<b><sup>d</sup></b> out of which there is no ordinary possibility of salvation.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 2:8; Rom 15:9-12; 1 Cor 1:2; 12:12-13; Rev 7:9.<br/>\n<b><sup>b</sup></b> Gen 3:15; 17:7; Ezek 16:20-21; Acts 2:39; Rom 11:16; 1 Cor 7:14.<br/>\n<b><sup>c</sup></b> Isa 9:7; Mat 13:47.<br/>\n<b><sup>d</sup></b> Eph 2:19; 3:15.<br/>\n<b><sup>e</sup></b> Acts 2:47.</sup></b></sup></b></div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Unto this catholic visible Church Christ hath given the ministry, oracles, and ordinances of God, for the gathering and perfecting of the saints, in this life, to the end of the world: and doth by his own presence and Spirit, according to his promise, make them effectual thereunto.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Isa 59:21; Mat 28:19-20; 1 Cor 12:28; Eph 4:11-13.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. This catholic Church hath been sometimes more, sometimes less visible.<b><sup>a</sup></b> And particular churches, which are members thereof, are more or less pure, according as the doctrine of the gospel is taught and embraced, ordinances administered, and public worship performed more or less purely in them.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 11:3-4; Rev 12:6, 14.<br/>\n<b><sup>b</sup></b> 1 Cor 5:6-7; Rev 2-3 throughout.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. The purest churches under heaven are subject both to mixture and error;<b><sup>a</sup></b> and some have so degenerated as to become no churches of Christ, but synagogues of Satan.<b><sup>b</sup></b> Nevertheless, there shall be always a Church on earth to worship God according to his will.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 13:24-30, 47; 1 Cor 13:12; Rev 2-3 throughout.<br/>\n<b><sup>b</sup></b> Rom 11:18-22; Rev 18:2.<br/>\n<b><sup>c</sup></b> Psa 72:17; 102:28; Mat 16:18; 28:19-20.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. There is no other head of the Church but the Lord Jesus Christ. Nor can the Pope of Rome, in any sense, be head thereof.</p>",
          "footnotes": "<b><sup>a</sup></b> Eph 1:22; Col 1:18.<br/>\n<b><sup>b</sup></b> Mat 23:8-10; 2 Thes 2:3-4, 8-9; Rev 13:6.</sup></b></sup></b></div>"
        }
      ]
    },
    {
      "chapter": "Chapter 26: Of the Communion of Saints",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. All saints that are united to Jesus Christ their head, by his Spirit and by faith, have fellowship with him in his graces, sufferings, death, resurrection, and glory:<b><sup>a</sup></b> and being united to one another in love, they have communion in each other's gifts and graces,<b><sup>b</sup></b> and are obliged to the performance of such duties, public and private, as do conduce to their mutual good, both in the inward and outward man.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 1:16; Rom 6:5-6; Eph 2:5-6; 3:16-19; Phil 3:10; 2 Tim 2:12; 1 John 1:3.<br/>\n<b><sup>b</sup></b> 1 Cor 3:21-23; 12:7; Eph 4:15-16; Col 2:19.<br/>\n<b><sup>c</sup></b> Rom 1:11-12, 14; Gal 6:10; 1 Thes 5:11, 14; 1 John 3:16-18.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. Saints, by profession, are bound to maintain an holy fellowship and communion in the worship of God, and in performing such other spiritual services as tend to their mutual edification;<b><sup>a</sup></b> as also in relieving each other in outward things, according to their several abilities and necessities. Which communion, as God offereth opportunity, is to be extended unto all those who, in every place, call upon the name of the Lord Jesus.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Isa 2:3; Acts 2:42, 46; 1 Cor 11:20; Heb 10:24-25.<br/>\n<b><sup>b</sup></b> Acts 2:44-45; 11:29-30; 2 Cor 8-9 throughout; 1 John 3:17.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. This communion which the saints have with Christ, doth not make them in any wise partakers of the substance of his Godhead, or to be equal with Christ in any respect: either of which to affirm is impious and blasphemous.<b><sup>a</sup></b> Nor doth their communion one with another, as saints, take away or infringe the title or propriety which each man hath in his goods and possessions.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Psa 45:7 with Heb 1:8-9; Isa 42:8; 1 Cor 8:6; Col 1:18-19; 1 Tim 6:15-16.<br/>\n<b><sup>b</sup></b> Exod 20:15; Acts 5:4; Eph 4:28.</sup></b></sup></b></div>"
        }
      ]
    },
    {
      "chapter": "Chapter 27: Of the Sacraments",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Sacraments are holy signs and seals of the covenant of grace,<b><sup>a</sup></b> immediately instituted by God,<b><sup>b</sup></b> to represent Christ and his benefits, and to confirm our interest in him:<b><sup>c</sup></b> as also to put a visible difference between those that belong unto the Church and the rest of the world;<b><sup>d</sup></b> and solemnly to engage them to the service of God in Christ, according to his Word.<b><sup>e</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 17:7, 10; Rom 4:11.<br/>\n<b><sup>b</sup></b> Mat 28:19; 1 Cor 11:23.<br/>\n<b><sup>c</sup></b> 1 Cor 10:16; 11:25-26; Gal 3:27.<br/>\n<b><sup>d</sup></b> Gen 34:14; Exod 12:48; Rom 15:8.<br/>\n<b><sup>e</sup></b> Rom 6:3-4; 1 Cor 10:16, 21.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. There is in every sacrament a spiritual relation or sacramental union, between the sign and the thing signified; whence it comes to pass that the names and the effects of the one are attributed to the other.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Gen 17:10; Mat 26:27-28; Titus 3:5.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. The grace which is exhibited in or by the sacraments, rightly used, is not conferred by any power in them; neither doth the efficacy of a sacrament depend upon the piety or intention of him that doth administer it,<b><sup>a</sup></b> but upon the work of the Spirit,<b><sup>b</sup></b> and the word of institution, which contains, together with a precept authorizing the use thereof, a promise of benefit to worthy receivers.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Rom 2:28-29; 1 Pet 3:21.<br/>\n<b><sup>b</sup></b> Mat 3:11; 1 Cor 12:13.<br/>\n<b><sup>c</sup></b> Mat 26:27-28.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. There be only two sacraments ordained by Christ our Lord in the Gospel, that is to say, Baptism and the Supper of the Lord: neither of which may be dispensed by any but by a minister of the Word lawfully ordained.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 28:19-20, 19; 1 Cor 4:1; 11:20, 23; Heb 5:4.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. The sacraments of the Old Testament, in regard of the spiritual things thereby signified and exhibited, were, for substance, the same with those of the New.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Cor 10:1-4.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 28: Of Baptism",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Baptism is a sacrament of the New Testament, ordained by Jesus Christ,<b><sup>a</sup></b> not only for the solemn admission of the party baptized into the visible Church,<b><sup>b</sup></b> but also to be unto him a sign and seal of the covenant of grace,<b><sup>c</sup></b> of his ingrafting into Christ,<b><sup>d</sup></b> of regeneration,<b><sup>e</sup></b> of remission of sins,<b><sup>f</sup></b> and of his giving up unto God, through Jesus Christ, to walk in newness of life:<b><sup>g</sup></b> which sacrament is, by Christ's own appointment, to be continued in his Church until the end of the world.<b><sup>h</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 28:19.<br/>\n<b><sup>b</sup></b> 1 Cor 12:13.<br/>\n<b><sup>c</sup></b> Rom 4:11 with Col 2:11-12.<br/>\n<b><sup>d</sup></b> Rom 6:5; Gal 3:27.<br/>\n<b><sup>e</sup></b> Titus 3:5.<br/>\n<b><sup>f</sup></b> Mark 1:4.<br/>\n<b><sup>g</sup></b> Rom 6:3-4.<br/>\n<b><sup>h</sup></b> Mat 28:19-20.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. The outward element to be used in this sacrament is water, wherewith the party is to be baptized in the name of the Father, and of the Son, and of the Holy Ghost, by a minister of the gospel lawfully called thereunto.</p>",
          "footnotes": "<b><sup>a</sup></b> Mat 3:11; 28:19-20; John 1:33.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Dipping of the person into the water is not necessary; but baptism is rightly administered by pouring or sprinkling water upon the person.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b>Mark 7:4; Acts 2:41; 16:33; Heb 9:10, 19-22.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. Not only those that do actually profess faith in and obedience unto Christ,<b><sup>a</sup></b> but also the infants of one or both believing parents are to be baptized.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mark 16:15-16; Acts 8:37-38.<br/>\n<b><sup>b</sup></b> Gen 17:7, 9 with Gal 3:9, 14 and Col 2:11-12 and Acts 2:38-39 and Rom 4:11-12; Mat 28:19; Mark 10:13-16; Luke 18:15; 1 Cor 7:14.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. Although it be a great sin to contemn or neglect this ordinance,<b><sup>a</sup></b> yet grace and salvation are not so inseparably annexed unto it, as that no person can be regenerated or saved without it,<b><sup>b</sup></b> or that all that are baptized are undoubtedly regenerated.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Luke 7:30 with Exod 4:24-26.<br/>\n<b><sup>b</sup></b> Acts 10:2, 4, 22, 31, 45, 47; Rom 4:11.<br/>\n<b><sup>c</sup></b> Acts 8:13, 23.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. The efficacy of baptism is not tied to that moment of time wherein it is administered;<b><sup>a</sup></b> yet, notwithstanding, by the right use of this ordinance the grace promised is not only offered, but really exhibited and conferred by the Holy Ghost, to such (whether of age or infants) as that grace belongeth unto, according to the counsel of God's own will, in his appointed time.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 3:5, 8.<br/>\n<b><sup>b</sup></b> Acts 2:38, 41; Gal 3:27; Eph 5:25-26; Titus 3:5.</div>"
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. The sacrament of baptism is but once to be administered to any person.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Titus 3:5.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 29: Of the Lord's Supper",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. Our Lord Jesus, in the night wherein he was betrayed, instituted the sacrament of his body and blood, called the Lord's Supper, to be observed in his Church, unto the end of the world; for the perpetual remembrance of the sacrifice of himself in his death, the sealing all benefits thereof unto true believers, their spiritual nourishment and growth in him, their further engagement in and to all duties which they owe unto him; and to be a bond and pledge of their communion with him, and with each other, as members of his mystical body.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Cor 10:16-17, 21; 11:23-26; 12:13.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. In this sacrament Christ is not offered up to his Father, nor any real sacrifice made at all for remission of sins of the quick or dead,<b><sup>a</sup></b> but only a commemoration of that one offering up of himself, by himself, upon the cross, once for all, and a spiritual oblation of all possible praise unto God for the same;<b><sup>b</sup></b> so that the Popish sacrifice of the mass, as they call it, is most abominably injurious to Christ's one only sacrifice, the alone propitiation for all the sins of the elect.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Heb 9:22, 25-26, 28.<br/>\n<b><sup>b</sup></b> Mat 26:26-27; 1 Cor 11:24-26.<br/>\n<b><sup>c</sup></b> Heb 7:23-24, 27; 10:11-12, 14, 18.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. The Lord Jesus hath, in this ordinance, appointed his ministers to declare his word of institution to the people, to pray, and bless the elements of bread and wine, and thereby to set them apart from a common to an holy use; and to take and break the bread, to take the cup, and (they communicating also themselves) to give both to the communicants;<strong><b><sup>a</sup></b></strong> but to none who are not then present in the congregation.<strong><b><sup>b</sup></b></strong></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 26:26-28 and Mark 14:22-24 and Luke 22:19-20 with 1 Cor 11:23-27.<br/>\n<b><sup>b</sup></b> Acts 20:7; 1 Cor 11:20.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. Private masses, or receiving this sacrament by a priest, or any other, alone;<b><sup>a</sup></b> as likewise the denial of the cup to the people;<b><sup>b</sup></b> worshipping the elements, the lifting them up, or carrying them about for adoration, and the reserving them for any pretended religious use, are all contrary to the nature of this sacrament, and to the institution of Christ.<b><sup>c</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Cor 10:6.<br/>\n<b><sup>b</sup></b> Mark 4:23; 1 Cor 11:25-29.<br/>\n<b><sup>d</sup></b> Mat 15:9.</div>"
        },
        {
          "paragraphNumber": 5,
          "text": "<p>V. The outward elements in this sacrament, duly set apart to the uses ordained by Christ, have such relation to him crucified, as that truly, yet sacramentally only, they are sometimes called by the name of the things they represent, to wit, the body and blood of Christ;<b><sup>a</sup></b> albeit, in substance and nature, they still remain truly, and only, bread and wine, as they were before.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 26:26-28.<br/>\n<b><sup>b</sup></b> Mat 26:29; 1 Cor 11:26-28.</div>"
        },
        {
          "paragraphNumber": 6,
          "text": "<p>VI. That doctrine which maintains a change of the substance of bread and wine, into the substance of Christ's body and blood (commonly called transubstantiation) by consecration of a priest, or by any other way, is repugnant, not to Scripture alone, but even to common sense and reason; overthroweth the nature of the sacrament; and hath been, and is the cause of manifold superstitions, yea, of gross idolatries.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Luke 24:6, 39; Acts 3:21 with 1 Cor 11:24-26.</div>"
        },
        {
          "paragraphNumber": 7,
          "text": "<p>VII. Worthy receivers, outwardly partaking of the visible elements in this sacrament,<b><sup>a</sup></b> do then also inwardly by faith, really and indeed, yet not carnally and corporally, but spiritually, receive and feed upon Christ crucified, and all benefits of his death: the body and blood of Christ being then not corporally or carnally in, with, or under the bread and wine; yet as really, but spiritually, present to the faith of believers in that ordinance, as the elements themselves are, to their outward senses.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Cor 11:28.<br/>\n<b><sup>b</sup></b> 1 Cor 10:16.</div>"
        },
        {
          "paragraphNumber": 8,
          "text": "<p>VIII. Although ignorant and wicked men receive the outward elements in this sacrament, yet they receive not the thing signified thereby; but by their unworthy coming thereunto are guilty of the body and blood of the Lord, to their own damnation. Wherefore all ignorant and ungodly persons, as they are unfit to enjoy communion with him, so are they unworthy of the Lord's table, and can not, without great sin against Christ, while they remain such, partake of these holy mysteries,<b><sup>a</sup></b> or be admitted thereunto.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Cor 11:27-29; 2 Cor 6:14-16.<br/>\n<b><sup>b</sup></b> Mat 7:6; 1 Cor 5:6-7, 13; 2 Thes 3:6, 14-15.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 30: Of Church Censures",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. The Lord Jesus, as king and head of his Church, hath therein appointed a government in the hand of Church officers, distinct from the civil magistrate.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Isa 9:6-7; Mat 28:18-20; Acts 20:17, 28; 1 Cor 12:28; 1 Thes 5:12; 1 Tim 5:17; Heb 13:7, 17, 24.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. To these officers the keys of the kingdom of heaven are committed, by virtue whereof they have power respectively to retain and remit sins, to shut that kingdom against the impenitent, both by the Word and censures; and to open it unto penitent sinners, by the ministry of the gospel, and by absolution from censures, as occasion shall require.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Isa 9:6-7; Mat 28:18-20; Acts 20:17, 28; 1 Cor 12:28; 1 Thes 5:12; 1 Tim 5:17; Heb 13:7, 17, 24.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. Church censures are necessary for the reclaiming and gaining of offending brethren; for deterring of others from the like offenses; for purging out of that leaven which might infect the whole lump; for vindicating the honor of Christ, and the holy profession of the gospel; and for preventing the wrath of God, which might justly fall upon the Church, if they should suffer his covenant, and the seals thereof, to be profaned by notorious and obstinate offenders.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 7:6; 1 Cor 5 throughout; 1 Cor 11:27-34 with Jude 1:23; 1 Tim 1:20; 5:20.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>IV. For the better attaining of these ends, the officers of the Church are to proceed by admonition, suspension from the Sacrament of the Lord's Supper for a season, and by excommunication from the Church, according to the nature of the crime and demerit of the person.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 18:17; 1 Cor 5:4-5, 13; 1 Thes 5:12; 2 Thes 3:6, 14-15; Titus 3:10.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 31: Of Synods and Councils",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. For the better government, and further edification of the Church, there ought to be such assemblies as are commonly called Synods or Councils; and it belongeth to the overseers and other rulers of the particular churches, by virtue of their office, and the power which Christ hath given them for edification and not for destruction, to appoint such assemblies; and to convene together in them, as often as they shall judge it expedient for the good of the church.</p>",
          "footnotes": "<b><sup>a</sup></b> Acts 15:2, 4, 6.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>III. It belongeth to synods and councils, ministerially, to determine controversies of faith, and cases of conscience; to set down rules and directions for the better ordering of the public worship of God, and government of his Church; to receive complaints in cases of maladministration, and authoritatively to determine the same: which decrees and determinations, if consonant to the Word of God, are to be received with reverence and submission, not only for their agreement with the Word, but also for the power whereby they are made, as being an ordinance of God, appointed thereunto in his Word.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 18:17-20; Acts 15:15, 19, 24, 27-31; 16:4.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>IV. All synods or councils since the apostles' times, whether general or particular, may err, and many have erred; therefore they are not to be made the rule of faith or practice, but to be used as a help in both.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Acts 17:11; 1 Cor 2:5; 2 Cor 1:24; Eph 2:20.</div>"
        },
        {
          "paragraphNumber": 4,
          "text": "<p>V. Synods and councils are to handle or conclude nothing but that which is ecclesiastical: and are not to intermeddle with civil affairs which concern the commonwealth, unless by way of humble petition in cases extraordinary; or by way of advice, for satisfaction of conscience, if they be thereunto required by the civil magistrate.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Luke 12:13-14; John 18:36.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 32: Of the State of Men after Death, and of the Resurrection of the Dead",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. The bodies of men, after death, return to dust, and see corruption;<b><sup>a</sup></b> but their souls (which neither die nor sleep), having an immortal subsistence,<b><sup>b</sup></b> immediately return to God who gave them. The souls of the righteous, being then made perfect in holiness, are received into the highest heavens, where they behold the face of God in light and glory, waiting for the full redemption of their bodies:<b><sup>c</sup></b> and the souls of the wicked are cast into hell, where they remain in torments and utter darkness, reserved to the judgment of the great day.<b><sup>d</sup></b> Besides these two places for souls separated from their bodies, the Scripture acknowledgeth none.</p>",
          "footnotes": "<b><sup>a</sup></b> Gen 3:19; Acts 13:36.<br/>\n<b><sup>b</sup></b> Ecc 12:7; Luke 23:43.<br/>\n<b><sup>c</sup></b> Phil 1:23 with Acts 3:21 and Eph 4:10; 2 Cor 5:1, 6, 8; Heb 12:23.<br/>\n<b><sup>d</sup></b> Luke 16:23-24; Acts 1:25; 1 Pet 3:19; Jude 1:6-7.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. At the last day, such as are found alive shall not die, but be changed;<b><sup>a</sup></b> and all the dead shall be raised up with the self-same bodies, and none other, although with different qualities, which shall be united again to their souls forever.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> 1 Cor 15:51-52; 1 Thes 4:17.<br/>\n<b><sup>b</sup></b> Job 19:26-27; 1 Cor 15:42-44.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. The bodies of the unjust shall, by the power of Christ, be raised to dishonor; the bodies of the just, by his Spirit, unto honor, and be made conformable to his own glorious body.<b><sup>a</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> John 5:28-29; Acts 24:15; 1 Cor 15:42; Phil 3:21.</div>"
        }
      ]
    },
    {
      "chapter": "Chapter 33: Of the Last Judgment",
      "paragraphs": [
        {
          "paragraphNumber": 1,
          "text": "<p>I. God hath appointed a day wherein he will judge the world in righteousness by Jesus Christ,<b><sup>a</sup></b>to whom all power and judgment is given of the Father.<b><sup>b</sup></b> In which day, not only the apostate angels shall be judged,<b><sup>c</sup></b> but likewise all persons, that have lived upon earth, shall appear before the tribunal of Christ, to give an account of their thoughts, words, and deeds; and to receive according to what they have done in the body, whether good or evil.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Acts 17:31.<br/>\n<b><sup>b</sup></b> John 5:22, 27.<br/>\n<b><sup>c</sup></b> 1 Cor 6:3; 2 Pet 2:4; Jude 1:6.<br/>\n<b><sup>d</sup></b> Ecc 12:14; Mat 12:36-37; Rom 2:16; 14:10, 12; 2 Cor 5:10.</div>"
        },
        {
          "paragraphNumber": 2,
          "text": "<p>II. The end of God's appointing this day, is for the manifestation of the glory of his mercy in the eternal salvation of the elect;<b><sup>a</sup></b> and of his justice in the damnation of the reprobate, who are wicked and disobedient.<b><sup>b</sup></b> For then shall the righteous go into everlasting life, and receive that fulness of joy and refreshing which shall come from the presence of the Lord:<b><sup>c</sup></b> but the wicked, who know not God, and obey not the gospel of Jesus Christ, shall be cast into eternal torments, and be punished with everlasting destruction from the presence of the Lord, and from the glory of his power.<b><sup>d</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Mat 25:21; Rom 9:23.<br/>\n<b><sup>b</sup></b> Rom 2:5-6; 9:22; 2 Thes 1:7-8.<br/>\n<b><sup>c</sup></b> Mat 25:31-34; Acts 3:19; 2 Thes 1:7.<br/>\n<b><sup>d</sup></b> Mat 25:41, 46; 2 Thes 1:9.</div>"
        },
        {
          "paragraphNumber": 3,
          "text": "<p>III. As Christ would have us to be certainly persuaded that there shall be a day of judgment, both to deter all men from sin, and for the greater consolation of the godly in their adversity:<b><sup>a</sup></b>so will he have that day unknown to men, that they may shake off all carnal security, and be always watchful, because they know not at what hour the Lord will come; and may be ever prepared to say, Come, Lord Jesus, come quickly. Amen.<b><sup>b</sup></b></p>",
          "footnotes": "<b><sup>a</sup></b> Luke 21:27-28; Rom 8:23-25; 2 Cor 5:10-11; 2 Thes 1:5-7; 2 Pet 3:11, 14.<br/>\n<b><sup>b</sup></b> Mat 24:36, 42-44; Mark 13:35-37; Luke 12:35-36; Rev 22:20.</div>"
        }
      ]
    }
  ]
}
